[
  {
    "pergunta": "What are you NOT allowed to do according to the AWS Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Start services in the Cloud as code",
        "explicacao": "This is allowed by AWS, as it involves using infrastructure as code to start services in the Cloud."
      },
      {
        "texto": "Buy a domain with Route 53",
        "explicacao": "Buying domains through Route 53 is allowed by AWS."
      },
      {
        "texto": "Run analytical processing on data that doesn't belong to you or that has been leaked on the internet",
        "explicacao": "This is prohibited by the AWS Acceptable Use Policy as it involves using data without authorization or leaked data."
      },
      {
        "texto": "Grant user access and passwords to users",
        "explicacao": "AWS allows the creation and management of accounts and access credentials for authorized users."
      }
    ],
    "respostaCorreta": "Run analytical processing on data that doesn't belong to you or that has been leaked on the internet",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "What are the deployment models AWS wants you to know?",
    "opcoes": [
      {
        "texto": "On-Premises, Hybrid, Cloud",
        "explicacao": "These are the three main infrastructure deployment models recommended by AWS: On-Premises, Hybrid, and Cloud."
      },
      {
        "texto": "On-Premises, Full, Cloud",
        "explicacao": "'Full' is not a deployment model recommended by AWS."
      },
      {
        "texto": "On-Premises, Hybrid, Full",
        "explicacao": "'Full' is not a deployment model recommended by AWS."
      },
      {
        "texto": "Full, Hybrid, Cloud",
        "explicacao": "'Full' is not a deployment model recommended by AWS."
      }
    ],
    "respostaCorreta": "On-Premises, Hybrid, Cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "What is the Cloud computing model where I am responsible for my application, my data, and the computer's operating system?",
    "opcoes": [
      {
        "texto": "Traditional",
        "explicacao": "The traditional model is not based on Cloud and requires you to be responsible for all the infrastructure, from hardware to software."
      },
      {
        "texto": "IaaS - Infrastructure as a Service",
        "explicacao": "In the IaaS model, you manage the operating system, applications, and data, but the physical infrastructure is managed by the Cloud provider."
      },
      {
        "texto": "SaaS - Software as a Service",
        "explicacao": "In the SaaS model, the Cloud provider manages everything, including the application, operating system, and data."
      },
      {
        "texto": "PaaS - Platform as a Service",
        "explicacao": "In the PaaS model, you are responsible for the application and data, but the Cloud provider manages the operating system and infrastructure."
      }
    ],
    "respostaCorreta": "IaaS - Infrastructure as a Service",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "When prospecting a new client, you are asked about the advantages of moving to the Cloud. What is the best commercial argument for such questions?",
    "opcoes": [
      {
        "texto": "Still Guessing: Moving to the Cloud is about making several attempts until finding the best computing power.",
        "explicacao": "This statement is inaccurate and can confuse the client about the efficiency and ease of use of the Cloud."
      },
      {
        "texto": "Go Global in minutes: You no longer need to wait for the purchase of a new server to improve performance. In the Cloud, you choose a service, configure it, and start using it.",
        "explicacao": "This is the correct answer, as it highlights the speed, scalability, and ease of access to Cloud resources, which are major commercial attractions."
      },
      {
        "texto": "Slow Speed: Moving to the Cloud means facing latency, but it is a very secure environment.",
        "explicacao": "This statement emphasizes latency, which could be seen as a disadvantage, and does not address the main commercial advantage of the Cloud."
      },
      {
        "texto": "Expensive: Moving to the Cloud might be expensive initially, but it offers competitive advantages.",
        "explicacao": "This response focuses on the initial cost and does not emphasize the primary advantage of speed and agility in the Cloud."
      }
    ],
    "respostaCorreta": "Go Global in minutes: You no longer need to wait for the purchase of a new server to improve performance. In the Cloud, you choose a service, configure it, and start using it.",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "In a meeting with your company's board to present the project of moving to the Cloud, the CFO raises his hand and asks about the financial advantage. What is the best argument to respond to such questions?",
    "opcoes": [
      {
        "texto": "We will reduce costs over time by decreasing Capex and increasing our Opex.",
        "explicacao": "This is the correct answer as migrating to the Cloud reduces capital expenses (Capex) by eliminating the need for on-premises infrastructure, while increasing Opex due to continuous payment for used resources."
      },
      {
        "texto": "We will reduce costs over time by decreasing Opex and increasing our Capex.",
        "explicacao": "This statement is incorrect because migrating to the Cloud typically reduces Capex and increases Opex, not the opposite."
      },
      {
        "texto": "We will not reduce costs because Capex is higher than Opex.",
        "explicacao": "This statement is incorrect as the Cloud generally reduces Capex and allows for more flexibility in operational costs."
      },
      {
        "texto": "We will not reduce costs because Opex is higher than Capex.",
        "explicacao": "This statement is incorrect and does not reflect the typical cost structure in the Cloud, where Capex is reduced in favor of Opex."
      }
    ],
    "respostaCorreta": "We will reduce costs over time by decreasing Capex and increasing our Opex.",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Your intern asks about what Cloud computing is. What is the best answer you can give?",
    "opcoes": [
      {
        "texto": "It is quantum computers with high availability and durability.",
        "explicacao": "Quantum computers are not the same as Cloud computing and do not correctly define the concept."
      },
      {
        "texto": "It is on-premises computers, which you access remotely.",
        "explicacao": "This description is incorrect, as on-premises refers to local servers, not the Cloud."
      },
      {
        "texto": "It is a set of programs you acquire and configure on your company's server.",
        "explicacao": "This definition is incorrect, as it refers to local infrastructure, not Cloud computing."
      },
      {
        "texto": "They are applications and/or services hosted in a datacenter outside your local environment (on-premises), responding to requests coming from the Internet.",
        "explicacao": "This is the correct answer as it clearly describes Cloud computing as being remotely hosted and accessed via the Internet."
      }
    ],
    "respostaCorreta": "They are applications and/or services hosted in a datacenter outside your local environment (on-premises), responding to requests coming from the Internet.",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "You work at a multinational that is in the phase of choosing an AWS support plan. Since your system is mission-critical, it cannot be down for more than 15 minutes. The company board also wants an AWS architect to review your Cloud environment. What is the best support plan you suggest?",
    "opcoes": [
      {
        "texto": "Basic",
        "explicacao": "The Basic plan does not offer technical support and does not meet the 15-minute SLA or environment review requirements."
      },
      {
        "texto": "Developer",
        "explicacao": "The Developer plan offers support during business hours but does not include a 15-minute SLA or architectural reviews."
      },
      {
        "texto": "Business",
        "explicacao": "The Business plan offers a 1-hour SLA for production system downtime and advanced technical support, but it does not meet the 15-minute SLA or include AWS architectural reviews."
      },
      {
        "texto": "Enterprise",
        "explicacao": "The Enterprise plan is the only one that offers a 15-minute SLA for production system downtime and includes architectural reviews with AWS architects, meeting the critical availability and consulting needs."
      }
    ],
    "respostaCorreta": "Enterprise",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which of the following options is one of the design principles related to cloud reliability?",
    "opcoes": [
      {
        "texto": "Protect data in transit and at rest",
        "explicacao": "Although important for security, this is not directly related to reliability."
      },
      {
        "texto": "Automatically recover from a failure",
        "explicacao": "This principle implies that systems should be designed to recover automatically from failures, ensuring reliability."
      },
      {
        "texto": "Run operations as code",
        "explicacao": "This is a best practice in the cloud but is not directly related to reliability."
      },
      {
        "texto": "Become global in minutes",
        "explicacao": "This relates to the speed of global deployment, but it is not directly a reliability principle."
      }
    ],
    "respostaCorreta": "Automatically recover from a failure",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "A company is seeking help to build a secure and high-performance application infrastructure using the latest AWS architecture best practices. Which of the following options can provide guidance for free?",
    "opcoes": [
      {
        "texto": "Contact an AWS Consulting Partner",
        "explicacao": "AWS Consulting Partners may charge for additional architecture services."
      },
      {
        "texto": "Open a ticket with AWS Managed Services",
        "explicacao": "AWS Managed Services offers managed support, but may come with additional costs."
      },
      {
        "texto": "Use an AWS Well-Architected Tool",
        "explicacao": "The AWS Well-Architected Tool is free and allows you to assess and optimize architecture using best practices."
      },
      {
        "texto": "Open a case with AWS Support",
        "explicacao": "AWS Support can provide assistance, but usually involves costs depending on the plan."
      }
    ],
    "respostaCorreta": "Use an AWS Well-Architected Tool",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which of the following options describes the hybrid cloud architecture in AWS?",
    "opcoes": [
      {
        "texto": "All resources running on AWS",
        "explicacao": "This describes a fully cloud-based architecture, not hybrid."
      },
      {
        "texto": "All resources running on on-premises infrastructure",
        "explicacao": "This describes an on-premises architecture, not hybrid."
      },
      {
        "texto": "Some resources available on AWS and others on on-premises infrastructure",
        "explicacao": "The hybrid architecture involves combining public cloud (AWS) with on-premises infrastructure."
      },
      {
        "texto": "Some resources running on AWS and others with another public cloud provider",
        "explicacao": "This describes a multicloud architecture, not hybrid."
      }
    ],
    "respostaCorreta": "Some resources available on AWS and others on on-premises infrastructure",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "A company has an application that needs to be globally available at all times. Which of the following deployment mechanisms should it use?",
    "opcoes": [
      {
        "texto": "Deployment in multiple availability zones",
        "explicacao": "This helps with high availability within a region, but does not guarantee global availability."
      },
      {
        "texto": "Deployment in multiple regions",
        "explicacao": "Deployment in multiple regions ensures global availability and low latency."
      },
      {
        "texto": "Deployment using CodeDeploy, as it automatically manages global application availability",
        "explicacao": "CodeDeploy manages deployments but does not guarantee global availability on its own."
      },
      {
        "texto": "Deployment in multiple edge locations",
        "explicacao": "Edge locations support content delivery, but do not provide full availability for a global application."
      }
    ],
    "respostaCorreta": "Deployment in multiple regions",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which AWS characteristic describes the ability to acquire resources as needed and release them when no longer needed?",
    "opcoes": [
      {
        "texto": "High availability",
        "explicacao": "High availability refers to the system's ability to keep running despite component failures."
      },
      {
        "texto": "Agility",
        "explicacao": "Agility refers to the ability to quickly implement and adapt infrastructure and services to meet business demands."
      },
      {
        "texto": "Elasticity",
        "explicacao": "Elasticity describes the ability to automatically adjust the amount of computational resources, scaling up or down as needed."
      },
      {
        "texto": "Durability",
        "explicacao": "Durability refers to the ability to preserve data long-term, ensuring it will not be lost."
      }
    ],
    "respostaCorreta": "Elasticity",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which of the following services provides on-demand access to AWS security and compliance reports?",
    "opcoes": [
      {
        "texto": "AWS Artifact",
        "explicacao": "AWS Artifact provides on-demand access to security and compliance reports, allowing customers to view audit reports."
      },
      {
        "texto": "AWS Trusted Advisor",
        "explicacao": "AWS Trusted Advisor provides recommendations to help optimize AWS infrastructure but does not provide access to compliance reports."
      },
      {
        "texto": "AWS CloudTrail",
        "explicacao": "AWS CloudTrail records API activities for auditing and tracking, but does not provide specific compliance reports."
      },
      {
        "texto": "Amazon Inspector",
        "explicacao": "Amazon Inspector is a service that evaluates the security of AWS instances, but does not provide compliance and security reports."
      }
    ],
    "respostaCorreta": "AWS Artifact",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "In the AWS shared responsibility model, which of the following is NOT a shared control?",
    "opcoes": [
      {
        "texto": "Patch management",
        "explicacao": "Patch management is a shared control between the customer and AWS, where AWS manages the infrastructure, and the customer is responsible for the operating system and applications."
      },
      {
        "texto": "Configuration management",
        "explicacao": "Configuration management is also a shared control, as the customer sets specific configurations for their resources, while AWS manages the security and compliance of the underlying infrastructure."
      },
      {
        "texto": "Physical and environmental controls",
        "explicacao": "AWS is fully responsible for physical and environmental controls in its data centers, with no involvement from the customer."
      },
      {
        "texto": "Awareness and training",
        "explicacao": "Awareness and training are the customer's responsibility, as they must ensure their team understands security practices and the use of cloud services."
      }
    ],
    "respostaCorreta": "Physical and environmental controls",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which AWS support plan offers a response time of up to 15 minutes when a critical business system is down?",
    "opcoes": [
      {
        "texto": "Enterprise",
        "explicacao": "The Enterprise plan is the only one that offers a response time of up to 15 minutes for critical issues."
      },
      {
        "texto": "Business",
        "explicacao": "The Business plan offers fast support, but the response time is not 15 minutes for all issues."
      },
      {
        "texto": "Developer",
        "explicacao": "The Developer plan is meant for testing and development, with no fast critical support."
      },
      {
        "texto": "Basic",
        "explicacao": "The Basic plan does not include technical support."
      }
    ],
    "respostaCorreta": "Enterprise",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which service allows you to automatically scale your application in response to demand?",
    "opcoes": [
      {
        "texto": "AWS ElastiCache",
        "explicacao": "AWS ElastiCache is a caching service, not an automatic scaling service."
      },
      {
        "texto": "Amazon Elastic Load Balancing",
        "explicacao": "Elastic Load Balancing distributes traffic between instances, but does not scale instances automatically."
      },
      {
        "texto": "Amazon EC2 Auto Scaling",
        "explicacao": "Amazon EC2 Auto Scaling allows you to configure rules and policies to automatically increase or decrease the number of EC2 instances based on demand."
      },
      {
        "texto": "Amazon DynamoDB",
        "explicacao": "Amazon DynamoDB is a managed database service but is not an automatic scaling service for compute instances."
      }
    ],
    "respostaCorreta": "Amazon EC2 Auto Scaling",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which AWS service provides centralized management and consolidated billing for all your AWS accounts?",
    "opcoes": [
      {
        "texto": "AWS CloudTrail",
        "explicacao": "AWS CloudTrail is an auditing and monitoring service, it does not offer centralized account management or billing."
      },
      {
        "texto": "AWS Organizations",
        "explicacao": "AWS Organizations allows centralized account management, access control, and consolidated billing, making it easier to manage multiple accounts."
      },
      {
        "texto": "AWS CloudWatch",
        "explicacao": "AWS CloudWatch is used for monitoring AWS resources and applications, not for consolidated billing."
      },
      {
        "texto": "AWS Direct Connect",
        "explicacao": "AWS Direct Connect provides a dedicated connection to AWS, but is not related to account management or billing."
      }
    ],
    "respostaCorreta": "AWS Organizations",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "You need to implement a managed message queue in transit between application servers. Which service should you use?",
    "opcoes": [
      {
        "texto": "Amazon SWF",
        "explicacao": "Amazon SWF is a workflow orchestration service and is not ideal for managing message queues."
      },
      {
        "texto": "Amazon SNS",
        "explicacao": "Amazon SNS is a notification service, ideal for sending messages to multiple subscribers, but it is not a message queue."
      },
      {
        "texto": "Amazon SQS",
        "explicacao": "Amazon SQS is a fully managed message queue service, ideal for reliably transmitting messages between application servers."
      },
      {
        "texto": "Amazon DynamoDB",
        "explicacao": "Amazon DynamoDB is a NoSQL database service, not a message queue service."
      }
    ],
    "respostaCorreta": "Amazon SQS",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "In AWS’s shared responsibility model, who is responsible for security and compliance?",
    "opcoes": [
      {
        "texto": "AWS is responsible",
        "explicacao": "In the shared responsibility model, AWS is responsible for the security of the infrastructure, but compliance is also shared."
      },
      {
        "texto": "The customer is responsible",
        "explicacao": "In the shared responsibility model, the customer is responsible for the security of their instances, but compliance is shared."
      },
      {
        "texto": "AWS and the customer share responsibility",
        "explicacao": "AWS and the customer share responsibility for security and compliance. AWS handles the security of the infrastructure, while the customer is responsible for configuring and using resources securely."
      },
      {
        "texto": "AWS is responsible for security, and the customer is responsible for compliance",
        "explicacao": "In reality, both security and compliance are shared responsibilities between AWS and the customer."
      }
    ],
    "respostaCorreta": "AWS and the customer share responsibility",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which AWS service allows you to codify your infrastructure and treat it purely as code?",
    "opcoes": [
      {
        "texto": "AWS CodeDeploy",
        "explicacao": "AWS CodeDeploy is used for automation of deployments, not for infrastructure as code."
      },
      {
        "texto": "AWS OpsWorks",
        "explicacao": "AWS OpsWorks is a configuration management platform and automation service, but it does not handle infrastructure as code."
      },
      {
        "texto": "AWS CodePipeline",
        "explicacao": "AWS CodePipeline is a continuous integration and delivery service, not for infrastructure as code."
      },
      {
        "texto": "AWS CloudFormation",
        "explicacao": "AWS CloudFormation is a service that allows you to create and manage AWS infrastructure resources using code, known as CloudFormation templates. With CloudFormation, you can describe your entire infrastructure, including EC2 instances, security groups, databases, networks, and more, in a single template file. Then, you can deploy and manage that infrastructure using simple commands, making the infrastructure as flexible and scalable as application code."
      }
    ],
    "respostaCorreta": "AWS CloudFormation",
    "explicacao": "AWS CloudFormation allows you to create and manage infrastructure resources using code, providing automation and flexibility in infrastructure management.",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which AWS service can you use to establish a dedicated network connection between your on-premises applications and AWS resources?",
    "opcoes": [
      {
        "texto": "AWS Snowball",
        "explicacao": "AWS Snowball is a physical device used to transfer large volumes of data between your on-premises infrastructure and AWS, but it is not used for dedicated network connections."
      },
      {
        "texto": "AWS Storage Gateway",
        "explicacao": "AWS Storage Gateway connects on-premises environments with AWS for storage, but does not provide a dedicated network connection."
      },
      {
        "texto": "AWS Shield",
        "explicacao": "AWS Shield is a service that protects against DDoS attacks and does not provide a dedicated network connection."
      },
      {
        "texto": "AWS Direct Connect",
        "explicacao": "AWS Direct Connect provides a dedicated and private network connection between your on-premises infrastructure and AWS, offering higher bandwidth, low latency, and high reliability."
      }
    ],
    "respostaCorreta": "AWS Direct Connect",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Where can you find listings of third-party software that make it easier to find, test, buy, and deploy software running on AWS?",
    "opcoes": [
      {
        "texto": "AWS CloudSearch",
        "explicacao": "AWS CloudSearch is a search service in AWS."
      },
      {
        "texto": "Amazon Lightsail",
        "explicacao": "Amazon Lightsail is a solution for simple computing services and predictable costs."
      },
      {
        "texto": "Amazon Athena",
        "explicacao": "Amazon Athena is a data query service for S3 using SQL."
      },
      {
        "texto": "AWS Marketplace",
        "explicacao": "AWS Marketplace is an online platform where you can discover, purchase, and easily deploy a wide variety of third-party software and solutions compatible with AWS."
      }
    ],
    "respostaCorreta": "AWS Marketplace",
    "explicacao": "AWS Marketplace is an online platform where you can discover, purchase, and easily deploy a wide variety of third-party software and solutions compatible with AWS.",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "What type of cloud service is most suitable for a lift-and-shift migration from an on-premises data center to a cloud deployment?",
    "opcoes": [
      {
        "texto": "IaaS (Infrastructure as a Service)",
        "explicacao": "IaaS is suitable for lift-and-shift migrations as it allows moving infrastructure resources to the cloud without major changes to the application."
      },
      {
        "texto": "PaaS (Platform as a Service)",
        "explicacao": "PaaS provides a higher level of abstraction and often requires application modifications, which may not be ideal for lift-and-shift migrations."
      },
      {
        "texto": "SaaS (Software as a Service)",
        "explicacao": "SaaS is a ready-to-use software solution and is not used for infrastructure migrations, but for direct consumption of applications."
      }
    ],
    "respostaCorreta": "IaaS (Infrastructure as a Service)",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "In which type of cloud service would a financial and expense control solution typically reside?",
    "opcoes": [
      {
        "texto": "IaaS (Infrastructure as a Service)",
        "explicacao": "IaaS provides basic infrastructure and is not typically used for specific solutions like financial control."
      },
      {
        "texto": "PaaS (Platform as a Service)",
        "explicacao": "PaaS allows for creating and developing solutions, but it is not commonly used for ready-made financial control applications."
      },
      {
        "texto": "SaaS (Software as a Service)",
        "explicacao": "SaaS is often used for complete applications such as financial and expense control because it is a ready-to-use solution."
      }
    ],
    "respostaCorreta": "SaaS (Software as a Service)",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is characterized as a system's ability to recover from failures and continue operating?",
    "opcoes": [
      {
        "texto": "Reliability",
        "explicacao": "Reliability refers to the system's consistency and stability in performing its intended function."
      },
      {
        "texto": "Availability",
        "explicacao": "Availability refers to the system’s uptime and ability to remain operational when required."
      },
      {
        "texto": "Resilience",
        "explicacao": "Resilience refers to the system's ability to recover from failures and continue its operation, even during disruptions."
      }
    ],
    "respostaCorreta": "Resilience",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "According to the shared responsibility model, which type of cloud service places the most responsibility on the customer?",
    "opcoes": [
      {
        "texto": "IaaS (Infrastructure as a Service)",
        "explicacao": "IaaS places the most responsibility on the consumer, with the cloud provider responsible for basic physical security, power, and connectivity."
      },
      {
        "texto": "SaaS (Software as a Service)",
        "explicacao": "SaaS places most of the responsibility on the cloud provider, with the customer focusing on using the provided software, while the cloud provider handles maintenance, security, updates, and more."
      },
      {
        "texto": "PaaS (Platform as a Service)",
        "explicacao": "PaaS is somewhere in between, evenly distributing responsibility between the cloud provider and the consumer."
      }
    ],
    "respostaCorreta": "IaaS (Infrastructure as a Service)",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which cloud model uses some data centers focused on providing cloud services to anyone and some data centers focused on a single customer?",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud model provides cloud services to anyone interested in using the services. The data centers are dedicated to anyone consuming cloud resources, not a single customer."
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud model combines public and private cloud, using data centers dedicated exclusively to one customer and others shared with the public."
      },
      {
        "texto": "Multicloud",
        "explicacao": "The multicloud model uses multiple public cloud providers to meet cloud needs."
      }
    ],
    "respostaCorreta": "Hybrid Cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is cloud computing?",
    "opcoes": [
      {
        "texto": "On-demand access to IT resources via the internet",
        "explicacao": "It allows users and companies to access and use technology resources like servers, storage, and applications via the internet, without managing these resources physically."
      },
      {
        "texto": "A private computer network",
        "explicacao": "Refers to an internal network connecting devices without access to the public internet."
      },
      {
        "texto": "Local data storage",
        "explicacao": "Refers to storing data on physical devices like hard drives or local servers."
      },
      {
        "texto": "Identity and access management",
        "explicacao": "Refers to controlling who can access resources within a system."
      }
    ],
    "respostaCorreta": "On-demand access to IT resources via the internet",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an advantage of cloud computing?",
    "opcoes": [
      {
        "texto": "Scalability",
        "explicacao": "Allows the capacity of IT resources to be increased or decreased based on demand."
      },
      {
        "texto": "Fixed cost",
        "explicacao": "Cloud costs are based on usage, not fixed."
      },
      {
        "texto": "Dedicated hardware",
        "explicacao": "Cloud resources are shared, not dedicated to a single customer."
      },
      {
        "texto": "Requires local management",
        "explicacao": "Cloud eliminates the need for local physical management."
      }
    ],
    "respostaCorreta": "Scalability",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a Platform as a Service (PaaS) model?",
    "opcoes": [
      {
        "texto": "A platform that allows developers to create, test, and manage applications",
        "explicacao": "PaaS provides a complete platform with tools for software development, without requiring management of underlying infrastructure."
      },
      {
        "texto": "Access to dedicated physical servers",
        "explicacao": "PaaS offers virtual servers, not dedicated physical ones."
      },
      {
        "texto": "Local data storage",
        "explicacao": "PaaS uses cloud storage rather than local storage."
      },
      {
        "texto": "A system for managing internal networks",
        "explicacao": "PaaS focuses on application development, not network management."
      }
    ],
    "respostaCorreta": "A platform that allows developers to create, test, and manage applications",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the benefit of the pay-as-you-go model in the cloud?",
    "opcoes": [
      {
        "texto": "You pay only for the resources you actually use",
        "explicacao": "The pay-as-you-go cloud model saves money since clients pay based on actual resource usage."
      },
      {
        "texto": "Fixed monthly cost",
        "explicacao": "Cloud costs are based on usage, not fixed."
      },
      {
        "texto": "Mandatory annual payment",
        "explicacao": "Cloud offers flexible payment models, without requiring mandatory annual contracts."
      },
      {
        "texto": "Prepaid payment for discount",
        "explicacao": "While there are reservation options, the pay-as-you-go model does not require advance payment."
      }
    ],
    "respostaCorreta": "You pay only for the resources you actually use",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an AWS region?",
    "opcoes": [
      {
        "texto": "A geographic location with multiple availability zones",
        "explicacao": "Each AWS region contains multiple availability zones to provide redundancy and high availability."
      },
      {
        "texto": "A cloud storage unit",
        "explicacao": "Storage units are not called regions in AWS."
      },
      {
        "texto": "A physical server dedicated to a customer",
        "explicacao": "AWS regions are made up of several data centers, not dedicated physical servers."
      },
      {
        "texto": "A network security system to protect data",
        "explicacao": "AWS regions are made up of physical data centers, not security networks."
      }
    ],
    "respostaCorreta": "A geographic location with multiple availability zones",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is scalability in cloud computing?",
    "opcoes": [
      {
        "texto": "The ability to increase or decrease resources as needed",
        "explicacao": "Scalability allows cloud resources to be adjusted according to demand."
      },
      {
        "texto": "The need to manage physical servers",
        "explicacao": "Cloud eliminates the need for managing physical servers, as this is handled by the service provider."
      },
      {
        "texto": "The fixed cost of IT resources",
        "explicacao": "Cloud IT costs are variable and usage-based, not fixed."
      },
      {
        "texto": "The allocation of dedicated servers",
        "explicacao": "Cloud resources are shared and scalable, rather than dedicated to a single client."
      }
    ],
    "respostaCorreta": "The ability to increase or decrease resources as needed",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an Infrastructure as a Service (IaaS) model?",
    "opcoes": [
      {
        "texto": "Provides IT infrastructure resources like servers and storage over the internet",
        "explicacao": "IaaS offers infrastructure such as servers and storage on a pay-as-you-go basis, without requiring management of physical hardware."
      },
      {
        "texto": "A platform for developing and managing applications",
        "explicacao": "This is the PaaS model, not IaaS."
      },
      {
        "texto": "An identity management solution",
        "explicacao": "IaaS provides infrastructure resources, not identity management directly."
      },
      {
        "texto": "A solution for managing local data",
        "explicacao": "IaaS focuses on providing cloud infrastructure, not local storage."
      }
    ],
    "respostaCorreta": "Provides IT infrastructure resources like servers and storage over the internet",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What are Availability Zones in AWS?",
    "opcoes": [
      {
        "texto": "Physically separate data centers within a region",
        "explicacao": "Availability Zones are data center units offering redundancy and high availability within a region."
      },
      {
        "texto": "Dedicated servers in a single location",
        "explicacao": "Availability Zones consist of multiple data centers, not dedicated servers."
      },
      {
        "texto": "Network resources for traffic management",
        "explicacao": "Availability Zones are data centers, while traffic management is handled by other services."
      },
      {
        "texto": "A security framework for cloud infrastructure",
        "explicacao": "Availability Zones refer to data centers, not a security framework."
      }
    ],
    "respostaCorreta": "Physically separate data centers within a region",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is data sovereignty in cloud computing?",
    "opcoes": [
      {
        "texto": "Ensuring that data is subject to the laws of the country where it is stored",
        "explicacao": "Data sovereignty refers to the fact that cloud data is governed by the laws of the country where it is physically located"
      },
      {
        "texto": "The automatic transfer of data to different countries",
        "explicacao": "Data sovereignty does not involve data transfer, but rather control over where the data is stored"
      },
      {
        "texto": "The ability to access data from anywhere in the world",
        "explicacao": "While the cloud allows global access, data sovereignty refers to the laws of the location where the data is stored"
      },
      {
        "texto": "Managing identities and access to data",
        "explicacao": "Data sovereignty is about jurisdiction over data, not access management"
      }
    ],
    "respostaCorreta": "Ensuring that data is subject to the laws of the country where it is stored",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What does a multi-tenant environment in the cloud mean?",
    "opcoes": [
      {
        "texto": "Multiple customers share the same infrastructure resources",
        "explicacao": "A multi-tenant environment allows multiple customers to use the same infrastructure while keeping their data isolated"
      },
      {
        "texto": "Each customer has their own dedicated servers",
        "explicacao": "In a multi-tenant environment, servers are shared among customers"
      },
      {
        "texto": "The cloud is used by a single organization",
        "explicacao": "Multi-tenant means that multiple customers are using the same environment"
      },
      {
        "texto": "Each customer manages their own infrastructure",
        "explicacao": "In a multi-tenant environment, the cloud provider manages the infrastructure"
      }
    ],
    "respostaCorreta": "Multiple customers share the same infrastructure resources",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a public cloud service?",
    "opcoes": [
      {
        "texto": "Computing services offered by a provider to the general public",
        "explicacao": "Public cloud services are accessible to anyone and are offered by providers like AWS, Azure, and Google Cloud"
      },
      {
        "texto": "Cloud services dedicated to a single organization",
        "explicacao": "Services dedicated to a single organization are considered private cloud, not public"
      },
      {
        "texto": "Services requiring physical management by the user",
        "explicacao": "In the public cloud, physical management is the responsibility of the provider"
      },
      {
        "texto": "Services available only to large enterprises",
        "explicacao": "The public cloud is available to anyone, regardless of company size"
      }
    ],
    "respostaCorreta": "Computing services offered by a provider to the general public",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the main characteristic of a private cloud?",
    "opcoes": [
      {
        "texto": "Resources dedicated to a single organization",
        "explicacao": "The private cloud is set up exclusively for a single organization, ensuring full control over resources"
      },
      {
        "texto": "Resources shared among multiple organizations",
        "explicacao": "Shared resources define public or multi-tenant clouds, not private clouds"
      },
      {
        "texto": "Universal and unrestricted access",
        "explicacao": "The private cloud is restricted to internal use within the organization"
      },
      {
        "texto": "No need to manage infrastructure",
        "explicacao": "In a private cloud, the organization still needs to manage the infrastructure"
      }
    ],
    "respostaCorreta": "Resources dedicated to a single organization",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a hybrid cloud service?",
    "opcoes": [
      {
        "texto": "A combination of public and private cloud",
        "explicacao": "A hybrid cloud combines public and private cloud resources, allowing flexibility and scalability"
      },
      {
        "texto": "A fully dedicated cloud",
        "explicacao": "A fully dedicated cloud is considered a private cloud"
      },
      {
        "texto": "A service only for data storage",
        "explicacao": "Hybrid clouds can include computing, storage, and other services, not just data storage"
      },
      {
        "texto": "A local management system",
        "explicacao": "Hybrid clouds use cloud resources, not local management systems"
      }
    ],
    "respostaCorreta": "A combination of public and private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is virtualization in the cloud?",
    "opcoes": [
      {
        "texto": "The process of creating virtual versions of IT resources, such as servers and storage",
        "explicacao": "Virtualization allows multiple operating systems and applications to share the same physical resources"
      },
      {
        "texto": "A method for protecting data in the cloud",
        "explicacao": "Virtualization refers to creating virtual resources, not directly to data protection"
      },
      {
        "texto": "The elimination of physical servers",
        "explicacao": "Virtualization does not eliminate physical servers, but optimizes them"
      },
      {
        "texto": "A type of storage service",
        "explicacao": "Virtualization is a concept that includes many types of services, not just storage"
      }
    ],
    "respostaCorreta": "The process of creating virtual versions of IT resources, such as servers and storage",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is disaster recovery in the cloud?",
    "opcoes": [
      {
        "texto": "The process of restoring services and data after an interruption",
        "explicacao": "Disaster recovery in the cloud involves using cloud resources to restore operations after an unexpected event"
      },
      {
        "texto": "A type of data backup",
        "explicacao": "While disaster recovery involves backups, its focus is on fully restoring services"
      },
      {
        "texto": "Ensuring security against cyber-attacks",
        "explicacao": "Disaster recovery focuses on restoration, not preventative security"
      },
      {
        "texto": "The elimination of old data",
        "explicacao": "Disaster recovery deals with restoration, not data deletion"
      }
    ],
    "respostaCorreta": "The process of restoring services and data after an interruption",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a disadvantage of public cloud?",
    "opcoes": [
      {
        "texto": "Less control over data security and privacy",
        "explicacao": "In a public cloud, data is stored on shared servers, which may raise security concerns"
      },
      {
        "texto": "High fixed monthly costs",
        "explicacao": "In the public cloud, costs are usage-based, not fixed"
      },
      {
        "texto": "The need to manage physical servers",
        "explicacao": "Public cloud providers manage the physical infrastructure"
      },
      {
        "texto": "Exclusive access for large enterprises",
        "explicacao": "The public cloud is available to anyone, regardless of company size"
      }
    ],
    "respostaCorreta": "Less control over data security and privacy",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is orchestration in the cloud?",
    "opcoes": [
      {
        "texto": "Automation and management of cloud processes and services",
        "explicacao": "Cloud orchestration involves coordinating and managing multiple services to work together"
      },
      {
        "texto": "The creation of new hardware resources",
        "explicacao": "Orchestration does not create hardware, but manages existing services"
      },
      {
        "texto": "A form of data backup",
        "explicacao": "Orchestration is about managing services, not backup"
      },
      {
        "texto": "A method to increase data security",
        "explicacao": "Orchestration focuses on management, not directly on security"
      }
    ],
    "respostaCorreta": "Automation and management of cloud processes and services",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the role of a firewall in the cloud?",
    "opcoes": [
      {
        "texto": "To protect IT resources from unauthorized access",
        "explicacao": "A cloud firewall monitors and controls network traffic to protect IT resources"
      },
      {
        "texto": "To securely store data",
        "explicacao": "Firewalls do not store data; they protect access to it"
      },
      {
        "texto": "To perform data backup",
        "explicacao": "Firewalls are not designed for backup; they focus on security"
      },
      {
        "texto": "To provide computing resources",
        "explicacao": "Firewalls are security devices, not computing resources"
      }
    ],
    "respostaCorreta": "To protect IT resources from unauthorized access",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "question": "What is a Container in the cloud?",
    "options": [
      {
        "text": "A unit that packages software and its dependencies for execution",
        "explanation": "Containers allow applications to run consistently across different environments by isolating their dependencies"
      },
      {
        "text": "A physical server dedicated to an application",
        "explanation": "Containers are virtual, not physical dedicated servers"
      },
      {
        "text": "A form of data storage",
        "explanation": "Containers are used for packaging software, not for storage"
      },
      {
        "text": "A method of data backup in the cloud",
        "explanation": "Containers are not methods of backup, but rather software units"
      }
    ],
    "correctAnswer": "A unit that packages software and its dependencies for execution",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is SLA in cloud services?",
    "options": [
      {
        "text": "An agreement on the service levels a provider must offer",
        "explanation": "The SLA (Service Level Agreement) defines performance and availability expectations between providers and customers"
      },
      {
        "text": "A price list of services",
        "explanation": "The SLA is not a price list, but an agreement on service levels"
      },
      {
        "text": "A method of user authentication",
        "explanation": "SLA refers to service levels, not authentication methods"
      },
      {
        "text": "A type of data backup",
        "explanation": "The SLA is not a type of backup, but rather an agreement on provided services"
      }
    ],
    "correctAnswer": "An agreement on the service levels a provider must offer",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "A company is looking for a solution that allows them to quickly scale their applications during demand spikes. Which of the following cloud services is most suitable for this?",
    "options": [
      {
        "text": "Dedicated server instances",
        "explanation": "Dedicated instances are not efficiently scalable in response to demand"
      },
      {
        "text": "Scalable cloud computing",
        "explanation": "Cloud computing allows you to scale resources quickly as needed"
      },
      {
        "text": "Local hard drive storage",
        "explanation": "Local storage does not allow scalability during demand spikes"
      },
      {
        "text": "Physical servers in a data center",
        "explanation": "Physical servers require time and resources to scale, making them impractical for variable demand"
      }
    ],
    "correctAnswer": "Scalable cloud computing",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What does 'high availability' mean in a cloud environment?",
    "options": [
      {
        "text": "Services are always accessible and functional, even during failures",
        "explanation": "High availability means that services are designed to remain operational even during failures"
      },
      {
        "text": "Only backup services are maintained",
        "explanation": "High availability refers to all services, not just backups"
      },
      {
        "text": "The ability to serve a single client",
        "explanation": "High availability is about general accessibility, not individual client access"
      },
      {
        "text": "Reduction of operational costs",
        "explanation": "High availability focuses on reliability, not necessarily on cost reduction"
      }
    ],
    "correctAnswer": "Services are always accessible and functional, even during failures",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is the main function of a load balancer in the cloud?",
    "options": [
      {
        "text": "Distribute traffic across multiple server instances",
        "explanation": "A load balancer distributes network traffic to ensure that no instance is overloaded"
      },
      {
        "text": "Store data securely",
        "explanation": "Load balancers do not store data, they manage traffic"
      },
      {
        "text": "Protect the network from attacks",
        "explanation": "Although load balancers can help with security, their primary function is traffic distribution"
      },
      {
        "text": "Increase network bandwidth",
        "explanation": "Load balancers manage traffic, but they do not increase bandwidth"
      }
    ],
    "correctAnswer": "Distribute traffic across multiple server instances",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is a Data Lake in the cloud?",
    "options": [
      {
        "text": "A repository that stores large volumes of raw data",
        "explanation": "A Data Lake allows data to be stored in its original format for later analysis"
      },
      {
        "text": "A location to store only structured data",
        "explanation": "Data Lakes store both structured and unstructured data"
      },
      {
        "text": "A type of relational database",
        "explanation": "Data Lakes are not relational databases; they are more flexible and support various types of data"
      },
      {
        "text": "A method of data backup",
        "explanation": "Data Lakes are used for storage, not as backup methods"
      }
    ],
    "correctAnswer": "A repository that stores large volumes of raw data",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "How does serverless architecture work in the cloud?",
    "options": [
      {
        "text": "Allows developers to write code without worrying about servers",
        "explanation": "In serverless architecture, the cloud provider manages the infrastructure, allowing developers to focus on code"
      },
      {
        "text": "Requires developers to manage all servers manually",
        "explanation": "Serverless architecture eliminates the need for manual server management"
      },
      {
        "text": "It is a solution for data storage",
        "explanation": "Serverless is about code execution, not storage"
      },
      {
        "text": "Imposes strict restrictions on application development",
        "explanation": "Serverless offers flexibility, not restrictions"
      }
    ],
    "correctAnswer": "Allows developers to write code without worrying about servers",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is the advantage of using containers in the cloud?",
    "options": [
      {
        "text": "Portability and consistency across environments",
        "explanation": "Containers allow applications to run consistently across different environments"
      },
      {
        "text": "Need for specific hardware",
        "explanation": "Containers are designed to be hardware-independent"
      },
      {
        "text": "Increase in operational costs",
        "explanation": "Containers can help reduce costs through resource efficiency"
      },
      {
        "text": "Dependence on physical servers",
        "explanation": "Containers are independent of physical servers and can run in any cloud environment"
      }
    ],
    "correctAnswer": "Portability and consistency across environments",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is the role of an authentication service in the cloud?",
    "options": [
      {
        "text": "Manage and verify user identities",
        "explanation": "Authentication services ensure that only authorized users have access to resources"
      },
      {
        "text": "Store data securely",
        "explanation": "Secure storage is a separate function from authentication"
      },
      {
        "text": "Provision new servers",
        "explanation": "Server provisioning is a different task from authentication"
      },
      {
        "text": "Create automatic backups",
        "explanation": "Authentication services do not handle data backups"
      }
    ],
    "correctAnswer": "Manage and verify user identities",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "question": "What is a cloud backup service?",
    "options": [
      {
        "text": "A service that stores copies of data securely",
        "explanation": "Cloud backup services store copies of data, allowing recovery in case of loss"
      },
      {
        "text": "A database management system",
        "explanation": "Backup is different from database management"
      },
      {
        "text": "A high-performance computing service",
        "explanation": "Backup services do not focus on performance, but on data security"
      },
      {
        "text": "A method of local storage",
        "explanation": "Cloud backup is a remote method, not local storage"
      }
    ],
    "correctAnswer": "A service that stores copies of data securely",
    "domain": "Conceitos da nuvem",
    "domainKey": "cloud_concepts",
    "type": "single"
  },
  {
    "pergunta": "What is the purpose of cloud cost management?",
    "opcoes": [
      {
        "texto": "Monitor and optimize spending on cloud services",
        "explicacao": "Cost management helps organizations understand and control their cloud expenses"
      },
      {
        "texto": "Reduce all services used",
        "explicacao": "Cost management does not mean eliminating services, but optimizing their usage"
      },
      {
        "texto": "Ensure service availability",
        "explicacao": "Availability is a different function from cost management"
      },
      {
        "texto": "Increase service complexity",
        "explicacao": "Cost management aims to simplify and optimize, not complicate"
      }
    ],
    "respostaCorreta": "Monitor and optimize spending on cloud services",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What does 'multi-cloud' mean?",
    "opcoes": [
      {
        "texto": "Using more than one cloud service provider",
        "explicacao": "'Multi-cloud' refers to the strategy of using services from different cloud providers"
      },
      {
        "texto": "Using only a single provider",
        "explicacao": "Multi-cloud involves multiple providers, not a single one"
      },
      {
        "texto": "A type of storage service",
        "explicacao": "Multi-cloud is not a specific service, but a strategic approach"
      },
      {
        "texto": "A data backup technique",
        "explicacao": "Multi-cloud refers to cloud strategies, not backups"
      }
    ],
    "respostaCorreta": "Using more than one cloud service provider",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the main function of a Content Delivery Network (CDN)?",
    "opcoes": [
      {
        "texto": "Reduce latency in content delivery",
        "explicacao": "A CDN stores copies of content in geographically distributed locations to speed up delivery to users"
      },
      {
        "texto": "Increase cloud storage capacity",
        "explicacao": "CDNs do not increase storage, but enhance content delivery"
      },
      {
        "texto": "Manage user data",
        "explicacao": "CDNs focus on content delivery, not data management"
      },
      {
        "texto": "Create automatic data backups",
        "explicacao": "CDNs are not backup solutions, but optimize content delivery"
      }
    ],
    "respostaCorreta": "Reduce latency in content delivery",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a cloud virtualization service?",
    "opcoes": [
      {
        "texto": "Creation of virtual environments on a single hardware",
        "explicacao": "Virtualization services allow multiple virtual machines to run on a single physical server"
      },
      {
        "texto": "Storage of data on physical hard drives",
        "explicacao": "Virtualization is not related to physical storage"
      },
      {
        "texto": "A data backup technique",
        "explicacao": "Virtualization is not a backup method, but a way to run multiple operating systems"
      },
      {
        "texto": "A method of access control",
        "explicacao": "Virtualization is about computing environments, not access control"
      }
    ],
    "respostaCorreta": "Creation of virtual environments on a single hardware",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the difference between IaaS and PaaS in the cloud?",
    "opcoes": [
      {
        "texto": "IaaS provides infrastructure, while PaaS provides a development platform",
        "explicacao": "IaaS offers virtualized hardware resources; PaaS provides tools for development and deployment"
      },
      {
        "texto": "Both offer storage services",
        "explicacao": "IaaS and PaaS have different focuses; IaaS is infrastructure, PaaS is about applications"
      },
      {
        "texto": "PaaS is more expensive than IaaS",
        "explicacao": "Prices depend on many factors, not just the service category"
      },
      {
        "texto": "IaaS is for end users, while PaaS is for developers",
        "explicacao": "Both can be used by developers and companies, but with different focuses"
      }
    ],
    "respostaCorreta": "IaaS provides infrastructure, while PaaS provides a development platform",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a cloud instance?",
    "opcoes": [
      {
        "texto": "A virtual machine that runs applications in the cloud",
        "explicacao": "Cloud instances are virtualized computing environments that run applications"
      },
      {
        "texto": "A type of data backup",
        "explicacao": "Instances are not backups, but computing environments"
      },
      {
        "texto": "A storage service",
        "explicacao": "Instances are used for computing, not storage"
      },
      {
        "texto": "A mobile application",
        "explicacao": "Instances refer to computing environments, not mobile applications"
      }
    ],
    "respostaCorreta": "A virtual machine that runs applications in the cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the importance of identity management in the cloud?",
    "opcoes": [
      {
        "texto": "Control who has access to cloud resources",
        "explicacao": "Identity management ensures that only authorized users can access cloud resources"
      },
      {
        "texto": "Increase storage capacity",
        "explicacao": "Identity management is not related to storage"
      },
      {
        "texto": "Reduce operational costs",
        "explicacao": "While it may help with efficiency, identity management focuses on security, not costs"
      },
      {
        "texto": "Improve connection speed",
        "explicacao": "Identity management does not directly affect connection speed"
      }
    ],
    "respostaCorreta": "Control who has access to cloud resources",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What characterizes public cloud computing?",
    "opcoes": [
      {
        "texto": "Resources are shared between multiple users",
        "explicacao": "In a public cloud, resources are offered to any user over the internet"
      },
      {
        "texto": "Resources are dedicated to a single client",
        "explicacao": "Dedicated resources characterize private clouds, not public clouds"
      },
      {
        "texto": "Requires dedicated local hardware",
        "explicacao": "Public clouds are accessible via the internet, not requiring local hardware"
      },
      {
        "texto": "Offers only storage",
        "explicacao": "Public clouds offer a variety of services, not just storage"
      }
    ],
    "respostaCorreta": "Resources are shared between multiple users",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the concept of 'auto-scaling' in the cloud?",
    "opcoes": [
      {
        "texto": "Dynamic adjustment of resources based on demand",
        "explicacao": "Auto-scaling allows the infrastructure to automatically increase or decrease resources as needed"
      },
      {
        "texto": "Manual capacity increase",
        "explicacao": "Auto-scaling eliminates the need for manual scaling, adjusting automatically"
      },
      {
        "texto": "Maintenance of physical servers",
        "explicacao": "Auto-scaling applies to virtual resources, not physical ones"
      },
      {
        "texto": "Reduction of fixed costs",
        "explicacao": "Auto-scaling helps optimize resources, but does not guarantee reduction in fixed costs"
      }
    ],
    "respostaCorreta": "Dynamic adjustment of resources based on demand",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the function of block storage in the cloud?",
    "opcoes": [
      {
        "texto": "Provide persistent data storage for virtual machines",
        "explicacao": "Block storage is used to store data that can be accessed by multiple virtual machines"
      },
      {
        "texto": "Store unstructured data like images and videos",
        "explicacao": "Block storage is for structured data and not ideal for unstructured data"
      },
      {
        "texto": "Backup data automatically",
        "explicacao": "Block storage is not a backup solution, but a way to store data for active use"
      },
      {
        "texto": "Improve internet connection speed",
        "explicacao": "Block storage is related to data storage, not internet speed"
      }
    ],
    "respostaCorreta": "Provide persistent data storage for virtual machines",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a benefit of hybrid cloud?",
    "opcoes": [
      {
        "texto": "Flexibility to combine public and private clouds",
        "explicacao": "Hybrid cloud allows businesses to leverage the best of both worlds by using public and private clouds as needed"
      },
      {
        "texto": "Greater reliance on on-premises servers",
        "explicacao": "Hybrid clouds aim to reduce reliance on on-premises servers by utilizing public clouds"
      },
      {
        "texto": "Reduced energy costs",
        "explicacao": "While there may be efficiency, the main benefit of hybrid cloud is flexibility, not energy cost reduction"
      },
      {
        "texto": "Increased management complexity",
        "explicacao": "Hybrid clouds can simplify management by combining different environments"
      }
    ],
    "respostaCorreta": "Flexibility to combine public and private clouds",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What characterizes a managed cloud provider?",
    "opcoes": [
      {
        "texto": "Responsibility for managing infrastructure and services",
        "explicacao": "Managed cloud providers handle all aspects of infrastructure and services for clients"
      },
      {
        "texto": "Only storage services",
        "explicacao": "Managed providers offer a range of services, not just storage"
      },
      {
        "texto": "Need for on-premises hardware",
        "explicacao": "Managed providers operate in the cloud and do not require client hardware"
      },
      {
        "texto": "Services without technical support",
        "explicacao": "Managed providers typically offer full technical support"
      }
    ],
    "respostaCorreta": "Responsibility for managing infrastructure and services",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an API in the cloud?",
    "opcoes": [
      {
        "texto": "A set of definitions that allows communication between systems",
        "explicacao": "APIs enable different systems to communicate, facilitating service integration"
      },
      {
        "texto": "A tool for storing data",
        "explicacao": "APIs are not storage tools but facilitate access to data and services"
      },
      {
        "texto": "A type of database",
        "explicacao": "APIs are programming interfaces, not databases"
      },
      {
        "texto": "A security protocol",
        "explicacao": "APIs may include security but are not security protocols themselves"
      }
    ],
    "respostaCorreta": "A set of definitions that allows communication between systems",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the purpose of load balancing in the cloud?",
    "opcoes": [
      {
        "texto": "Distribute network traffic across multiple servers",
        "explicacao": "Load balancing improves availability and performance by distributing traffic"
      },
      {
        "texto": "Increase cloud storage",
        "explicacao": "Load balancing is not related to storage but to traffic distribution"
      },
      {
        "texto": "Create automatic backups",
        "explicacao": "Load balancing does not serve as a backup function but optimizes performance"
      },
      {
        "texto": "Manage user identities",
        "explicacao": "Load balancing focuses on traffic distribution, not identity management"
      }
    ],
    "respostaCorreta": "Distribute network traffic across multiple servers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What does the acronym SaaS stand for?",
    "opcoes": [
      {
        "texto": "Software as a Service",
        "explicacao": "SaaS refers to applications offered as services over the internet"
      },
      {
        "texto": "System as a Service",
        "explicacao": "SaaS does not stand for System as a Service; it refers to software, not systems"
      },
      {
        "texto": "Security as a Service",
        "explicacao": "SaaS refers to software, not security"
      },
      {
        "texto": "Storage as a Service",
        "explicacao": "SaaS is specifically about software, not storage"
      }
    ],
    "respostaCorreta": "Software as a Service",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What characterizes a private cloud?",
    "opcoes": [
      {
        "texto": "Resources are dedicated to a single organization",
        "explicacao": "Private clouds are designed for exclusive use by a single organization"
      },
      {
        "texto": "Resources shared between multiple organizations",
        "explicacao": "This characterizes public clouds, not private ones"
      },
      {
        "texto": "Access only by mobile devices",
        "explicacao": "Private clouds can be accessed from any device, not just mobile"
      },
      {
        "texto": "Data storage in the public cloud",
        "explicacao": "Private clouds keep data under the organization's exclusive control"
      }
    ],
    "respostaCorreta": "Resources are dedicated to a single organization",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the purpose of a cloud configuration management service?",
    "opcoes": [
      {
        "texto": "Automate cloud resource management",
        "explicacao": "Configuration management services help automate and manage cloud infrastructure"
      },
      {
        "texto": "Store device configuration data",
        "explicacao": "While related, the focus is more on automation than storage"
      },
      {
        "texto": "Provide access to user data",
        "explicacao": "Configuration management is not focused on user data access"
      },
      {
        "texto": "Create data backups",
        "explicacao": "Configuration management is not a backup service but an automation service"
      }
    ],
    "respostaCorreta": "Automate cloud resource management",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the advantage of using containers in the cloud?",
    "opcoes": [
      {
        "texto": "Ease of deployment and scalability of applications",
        "explicacao": "Containers allow applications to be deployed consistently and scalably"
      },
      {
        "texto": "Increased data security",
        "explicacao": "Containers offer isolation, but security depends on implementation practices"
      },
      {
        "texto": "Reduced storage costs",
        "explicacao": "Containers do not directly reduce storage costs, but optimize resource usage"
      },
      {
        "texto": "Need for dedicated hardware",
        "explicacao": "Containers are lightweight environments that can run on shared hardware"
      }
    ],
    "respostaCorreta": "Ease of deployment and scalability of applications",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a cloud backup service?",
    "opcoes": [
      {
        "texto": "A solution to store backup copies of data",
        "explicacao": "Cloud backup services allow users to securely store copies of data in the cloud"
      },
      {
        "texto": "A method for recovering lost data",
        "explicacao": "Backup is a step in recovery, but the backup service is broader"
      },
      {
        "texto": "A tool for identity management",
        "explicacao": "Backup services are not identity management tools"
      },
      {
        "texto": "A local storage service",
        "explicacao": "Cloud backup services refer to remote storage, not local"
      }
    ],
    "respostaCorreta": "A solution to store backup copies of data",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the function of a serverless architecture?",
    "opcoes": [
      {
        "texto": "Run code without the need to manage servers",
        "explicacao": "Serverless architecture allows developers to run code without worrying about the underlying infrastructure"
      },
      {
        "texto": "Requires dedicated hardware for each application",
        "explicacao": "Serverless architecture eliminates the need for dedicated hardware"
      },
      {
        "texto": "Increase development complexity",
        "explicacao": "Serverless architectures aim to simplify development by abstracting infrastructure"
      },
      {
        "texto": "Offer physical machines to clients",
        "explicacao": "Serverless is a cloud computing model, not related to physical machines"
      }
    ],
    "respostaCorreta": "Run code without the need to manage servers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a data lake in the cloud?",
    "opcoes": [
      {
        "texto": "A repository of raw data in its original form",
        "explicacao": "Data lakes store large volumes of unprocessed data for later analysis"
      },
      {
        "texto": "A structured relational database",
        "explicacao": "Data lakes are different from relational databases as they store unstructured data"
      },
      {
        "texto": "A temporary storage solution",
        "explicacao": "Data lakes are designed to store data long-term, not temporarily"
      },
      {
        "texto": "A data visualization tool",
        "explicacao": "Data lakes are data repositories, not visualization tools"
      }
    ],
    "respostaCorreta": "A repository of raw data in its original form",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is cloud virtualization?",
    "opcoes": [
      {
        "texto": "Creation of virtual versions of physical resources",
        "explicacao": "Virtualization allows physical resources to be represented as virtual, optimizing usage"
      },
      {
        "texto": "A type of data management software",
        "explicacao": "Virtualization is not software, but a technology that creates virtual instances"
      },
      {
        "texto": "A data backup method",
        "explicacao": "Virtualization is not a backup method, but a resource optimization technique"
      },
      {
        "texto": "A local storage solution",
        "explicacao": "Virtualization refers to virtual environments, not physical storage"
      }
    ],
    "respostaCorreta": "Creation of virtual versions of physical resources",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a hypervisor?",
    "opcoes": [
      {
        "texto": "Software that allows the creation and management of virtual machines",
        "explicacao": "Hypervisors allow multiple virtual machines to operate on a single physical hardware"
      },
      {
        "texto": "A type of cloud storage",
        "explicacao": "Hypervisors are not storage solutions, but manage virtual environments"
      },
      {
        "texto": "An application that protects data in the cloud",
        "explicacao": "Hypervisors do not focus on data security, but on hardware virtualization"
      },
      {
        "texto": "A specialized operating system",
        "explicacao": "Hypervisors are not operating systems but act as a virtualization layer over them"
      }
    ],
    "respostaCorreta": "Software that allows the creation and management of virtual machines",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the main function of a hypervisor?",
    "opcoes": [
      {
        "texto": "Manage hardware resources among multiple virtual machines",
        "explicacao": "Hypervisors allocate physical resources to the virtual machines they manage"
      },
      {
        "texto": "Create data backups",
        "explicacao": "The main function of hypervisors is not backup but virtualization"
      },
      {
        "texto": "Install operating systems on physical servers",
        "explicacao": "Although they can assist with this, hypervisors are more focused on virtualization than installation"
      },
      {
        "texto": "Protect networks from external attacks",
        "explicacao": "Hypervisors do not primarily focus on network security"
      }
    ],
    "respostaCorreta": "Manage hardware resources among multiple virtual machines",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What are the two main types of hypervisors?",
    "opcoes": [
      {
        "texto": "Type 1 and Type 2 hypervisors",
        "explicacao": "Type 1 hypervisors run directly on hardware, while Type 2 hypervisors run on an operating system"
      },
      {
        "texto": "Local and remote hypervisors",
        "explicacao": "Hypervisors are not classified this way; the correct classification is Type 1 and Type 2"
      },
      {
        "texto": "Virtual and physical hypervisors",
        "explicacao": "This is not a recognized classification; the correct one is Type 1 and Type 2"
      },
      {
        "texto": "Storage and network hypervisors",
        "explicacao": "Hypervisors are not classified by storage or network"
      }
    ],
    "respostaCorreta": "Type 1 and Type 2 hypervisors",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a characteristic of Type 1 hypervisors?",
    "opcoes": [
      {
        "texto": "Runs directly on physical hardware",
        "explicacao": "Type 1 hypervisors operate without an underlying operating system, managing the hardware directly"
      },
      {
        "texto": "Requires an operating system to function",
        "explicacao": "Type 1 hypervisors do not need an OS; they are installed directly on the hardware"
      },
      {
        "texto": "Less efficient than Type 2",
        "explicacao": "Type 1 hypervisors are generally more efficient as they access the hardware directly"
      },
      {
        "texto": "Always free",
        "explicacao": "Not all Type 1 hypervisors are free"
      }
    ],
    "respostaCorreta": "Runs directly on physical hardware",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a Type 2 hypervisor?",
    "opcoes": [
      {
        "texto": "A hypervisor that operates on an operating system",
        "explicacao": "Type 2 hypervisors are installed over an operating system and rely on it for functioning"
      },
      {
        "texto": "A hypervisor faster than Type 1",
        "explicacao": "Type 2 hypervisors are usually less efficient than Type 1 as they depend on an OS"
      },
      {
        "texto": "A hypervisor that does not support virtualization",
        "explicacao": "Type 2 hypervisors support virtualization, but less efficiently than Type 1"
      },
      {
        "texto": "A hypervisor dedicated to physical servers",
        "explicacao": "Type 2 hypervisors are not dedicated to physical servers but to operating systems"
      }
    ],
    "respostaCorreta": "A hypervisor that operates on an operating system",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an advantage of using hypervisors in the cloud?",
    "opcoes": [
      {
        "texto": "Better utilization of hardware resources",
        "explicacao": "Hypervisors allow efficient use of hardware resources by creating virtual machines"
      },
      {
        "texto": "Need for dedicated hardware for each application",
        "explicacao": "Hypervisors eliminate the need for dedicated hardware, allowing resource sharing"
      },
      {
        "texto": "Increased operational costs",
        "explicacao": "Hypervisors help reduce operational costs by improving resource utilization"
      },
      {
        "texto": "Increased management complexity",
        "explicacao": "Hypervisors generally simplify resource management compared to physical servers"
      }
    ],
    "respostaCorreta": "Better utilization of hardware resources",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How do hypervisors contribute to security in the cloud?",
    "opcoes": [
      {
        "texto": "By isolating virtual machines from each other",
        "explicacao": "Hypervisors create an isolated environment for each virtual machine, enhancing security"
      },
      {
        "texto": "By increasing the number of physical servers",
        "explicacao": "Hypervisors do not increase physical servers; they optimize the use of existing ones"
      },
      {
        "texto": "By eliminating the need for authentication",
        "explicacao": "Hypervisors do not eliminate authentication but help manage secure environments"
      },
      {
        "texto": "By preventing access to external networks",
        "explicacao": "Hypervisors do not prevent access but offer isolation between virtual machines"
      }
    ],
    "respostaCorreta": "By isolating virtual machines from each other",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How do hypervisors impact scalability in the cloud?",
    "opcoes": [
      {
        "texto": "Facilitating the addition of new virtual machines as needed",
        "explicacao": "Hypervisors enable easy resource scaling by creating new virtual machines on demand"
      },
      {
        "texto": "Reducing available hardware capacity",
        "explicacao": "Hypervisors do not reduce hardware capacity but rather optimize it"
      },
      {
        "texto": "Increasing configuration complexity",
        "explicacao": "Hypervisors generally simplify resource configuration and management"
      },
      {
        "texto": "Preventing the use of physical servers",
        "explicacao": "Hypervisors allow efficient use of physical servers, not the opposite"
      }
    ],
    "respostaCorreta": "Facilitating the addition of new virtual machines as needed",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a benefit of virtualization with hypervisors?",
    "opcoes": [
      {
        "texto": "Reduction of operational costs",
        "explicacao": "Virtualization helps reduce costs by maximizing hardware utilization"
      },
      {
        "texto": "Increased need for physical maintenance",
        "explicacao": "Virtualization generally reduces the need for physical maintenance by optimizing resources"
      },
      {
        "texto": "Greater dependency on specific hardware",
        "explicacao": "Virtualization allows hardware independence, increasing flexibility"
      },
      {
        "texto": "Need to install additional software on each machine",
        "explicacao": "Virtualization allows multiple virtual machines to share the same environment without additional software"
      }
    ],
    "respostaCorreta": "Reduction of operational costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What does CAPEX mean?",
    "opcoes": [
      {
        "texto": "Capital expenses related to asset acquisition",
        "explicacao": "CAPEX refers to investments in long-term assets such as equipment and infrastructure"
      },
      {
        "texto": "Operational expenses related to day-to-day activities",
        "explicacao": "This definition applies to OPEX, not CAPEX"
      },
      {
        "texto": "Investments in research and development",
        "explicacao": "Although it may include this, CAPEX is broader, encompassing tangible assets"
      },
      {
        "texto": "Only expenses related to information technology",
        "explicacao": "CAPEX can include various areas, not just IT"
      }
    ],
    "respostaCorreta": "Capital expenses related to asset acquisition",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a characteristic of OPEX?",
    "opcoes": [
      {
        "texto": "Recurring and operational costs",
        "explicacao": "OPEX refers to continuous expenses a company faces in its daily operations"
      },
      {
        "texto": "Investments in long-term assets",
        "explicacao": "This definition applies to CAPEX, not OPEX"
      },
      {
        "texto": "One-time and non-recurring expenses",
        "explicacao": "OPEX is characterized by costs that repeat over time"
      },
      {
        "texto": "Does not affect cash flow",
        "explicacao": "OPEX directly impacts a company's cash flow"
      }
    ],
    "respostaCorreta": "Recurring and operational costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Why do companies opt for OPEX instead of CAPEX in the cloud?",
    "opcoes": [
      {
        "texto": "Flexibility and scalability in operations",
        "explicacao": "OPEX allows companies to pay as they go, making it easier to adapt to changes"
      },
      {
        "texto": "Less need for human resources",
        "explicacao": "The transition to OPEX does not necessarily reduce the need for human resources"
      },
      {
        "texto": "Total elimination of expenses",
        "explicacao": "OPEX does not eliminate expenses but makes them more predictable and manageable"
      },
      {
        "texto": "Investment in long-term assets",
        "explicacao": "OPEX does not involve investments in assets; this is characteristic of CAPEX"
      }
    ],
    "respostaCorreta": "Flexibility and scalability in operations",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following is an example of CAPEX?",
    "opcoes": [
      {
        "texto": "Purchase of physical servers",
        "explicacao": "This is a capital expense as it involves acquiring physical assets"
      },
      {
        "texto": "Monthly payment for cloud services",
        "explicacao": "This payment is an operational expense (OPEX)"
      },
      {
        "texto": "Hiring technical support services",
        "explicacao": "This falls under OPEX as it is a continuous expense"
      },
      {
        "texto": "Software licensing by subscription",
        "explicacao": "This is an example of OPEX, not CAPEX"
      }
    ],
    "respostaCorreta": "Purchase of physical servers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How can the OPEX model impact cash flow?",
    "opcoes": [
      {
        "texto": "Generates predictable monthly expenses",
        "explicacao": "OPEX allows companies to plan their expenses more efficiently"
      },
      {
        "texto": "Increases the variability of expenses",
        "explicacao": "OPEX generally results in more stable and predictable expenses"
      },
      {
        "texto": "Eliminates the need for financial planning",
        "explicacao": "Financial planning is still necessary, even with OPEX"
      },
      {
        "texto": "Prevents investments in innovation",
        "explicacao": "OPEX can allow more investments in innovation by freeing up capital"
      }
    ],
    "respostaCorreta": "Generates predictable monthly expenses",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a disadvantage of the CAPEX model?",
    "opcoes": [
      {
        "texto": "Need for high initial investments",
        "explicacao": "CAPEX requires significant upfront expenditures, which can be a barrier"
      },
      {
        "texto": "Unpredictable operational costs",
        "explicacao": "CAPEX tends to have more predictable expenses than OPEX"
      },
      {
        "texto": "Less control over assets",
        "explicacao": "CAPEX generally gives more control over acquired assets"
      },
      {
        "texto": "Less flexibility in financial adjustments",
        "explicacao": "CAPEX can be less flexible due to high initial investment"
      }
    ],
    "respostaCorreta": "Need for high initial investments",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which approach can help a company turn CAPEX into OPEX?",
    "opcoes": [
      {
        "texto": "Migrating to cloud solutions",
        "explicacao": "Migrating to the cloud generally transforms capital expenses into operational ones"
      },
      {
        "texto": "Buying more physical equipment",
        "explicacao": "This would increase CAPEX, not transform it into OPEX"
      },
      {
        "texto": "Reducing technology use",
        "explicacao": "Reducing technology does not help transform CAPEX into OPEX"
      },
      {
        "texto": "Increasing investments in physical assets",
        "explicacao": "This would increase CAPEX, not aid in the transformation to OPEX"
      }
    ],
    "respostaCorreta": "Migrating to cloud solutions",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a benefit of combining CAPEX and OPEX?",
    "opcoes": [
      {
        "texto": "Greater financial flexibility",
        "explicacao": "Combining CAPEX and OPEX can help balance investments and expenses"
      },
      {
        "texto": "Total reduction of expenses",
        "explicacao": "Combining does not eliminate expenses but can improve financial management"
      },
      {
        "texto": "Elimination of the need for planning",
        "explicacao": "Planning is still necessary even when combining CAPEX and OPEX"
      },
      {
        "texto": "Greater operational complexity",
        "explicacao": "It can simplify operations by optimizing resource management"
      }
    ],
    "respostaCorreta": "Greater financial flexibility",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How can the choice between CAPEX and OPEX affect business strategy?",
    "opcoes": [
      {
        "texto": "Determines the capacity for investment in innovation",
        "explicacao": "The choice can affect how much a company can invest in new opportunities"
      },
      {
        "texto": "Has no impact on business decisions",
        "explicacao": "The choice between CAPEX and OPEX is crucial for financial strategy"
      },
      {
        "texto": "Increases operational complexity",
        "explicacao": "The choice can simplify or complicate operations, depending on the approach"
      },
      {
        "texto": "Is irrelevant to resource allocation",
        "explicacao": "Resource allocation is directly influenced by the choice between CAPEX and OPEX"
      }
    ],
    "respostaCorreta": "Determines the capacity for investment in innovation",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company is considering changing its financial approach to the cloud. What is an advantage of adopting OPEX over CAPEX?",
    "opcoes": [
      {
        "texto": "Lower initial investment in assets",
        "explicacao": "OPEX allows the company to pay for services as they are used, reducing initial investment"
      },
      {
        "texto": "Increased control over physical assets",
        "explicacao": "OPEX does not provide the same level of control over assets as CAPEX"
      },
      {
        "texto": "Predictable and lower fixed expenses",
        "explicacao": "OPEX can result in variable expenses depending on usage, unlike CAPEX"
      },
      {
        "texto": "Requires constant asset management",
        "explicacao": "With OPEX, asset management is reduced since many services are outsourced"
      }
    ],
    "respostaCorreta": "Lower initial investment in assets",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "An organization is evaluating the costs of its IT operations. What is the main difference between CAPEX and OPEX?",
    "opcoes": [
      {
        "texto": "CAPEX refers to operational expenses, while OPEX is investment in assets",
        "explicacao": "Actually, CAPEX is for assets, while OPEX covers operational expenses"
      },
      {
        "texto": "CAPEX involves one-time costs, while OPEX involves recurring costs",
        "explicacao": "This is a crucial difference that affects financial management"
      },
      {
        "texto": "OPEX is always higher than CAPEX",
        "explicacao": "No, the total can vary depending on the spending strategy"
      },
      {
        "texto": "CAPEX is always more flexible than OPEX",
        "explicacao": "CAPEX is less flexible due to long-term commitments"
      }
    ],
    "respostaCorreta": "CAPEX involves one-time costs, while OPEX involves recurring costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A CFO is analyzing the migration to the cloud. What is a reason for preferring an OPEX model?",
    "opcoes": [
      {
        "texto": "Allows more predictability in expenses",
        "explicacao": "OPEX provides better control over the monthly budget"
      },
      {
        "texto": "Completely eliminates the need for investments",
        "explicacao": "OPEX does not eliminate investments, it just changes their form"
      },
      {
        "texto": "Requires higher initial investment than CAPEX",
        "explicacao": "The OPEX model generally requires less initial investment"
      },
      {
        "texto": "Makes the company less competitive",
        "explicacao": "OPEX can actually help maintain competitiveness by freeing up capital"
      }
    ],
    "respostaCorreta": "Allows more predictability in expenses",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A startup wants to minimize its initial spending. What financial model is best suited for its cloud operations?",
    "opcoes": [
      {
        "texto": "CAPEX, as it allows for the acquisition of long-term assets",
        "explicacao": "CAPEX requires high initial spending, which is not ideal for startups"
      },
      {
        "texto": "OPEX, as it allows for pay-as-you-go",
        "explicacao": "OPEX aligns better with the needs of startups, enabling scalability"
      },
      {
        "texto": "CAPEX, as it provides full control over assets",
        "explicacao": "This is impractical for a startup looking for agility"
      },
      {
        "texto": "OPEX, but only if subsidized",
        "explicacao": "OPEX can be advantageous even without subsidies, as it offers flexibility"
      }
    ],
    "respostaCorreta": "OPEX, as it allows for pay-as-you-go",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A mid-sized company wants to expand its digital services. What financial approach can facilitate this expansion?",
    "opcoes": [
      {
        "texto": "Invest in CAPEX to buy more servers",
        "explicacao": "CAPEX may limit the agility needed for rapid expansion"
      },
      {
        "texto": "Opt for OPEX for on-demand cloud services",
        "explicacao": "OPEX allows the company to quickly adjust operations based on demand"
      },
      {
        "texto": "Focus only on marketing expenses",
        "explicacao": "The financial approach should also include operational considerations"
      },
      {
        "texto": "Combine CAPEX and OPEX to ensure stability",
        "explicacao": "Although useful, focusing solely on OPEX may be more advantageous for rapid expansion"
      }
    ],
    "respostaCorreta": "Opt for OPEX for on-demand cloud services",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company is evaluating its IT expenses. Which of the following represents an OPEX expense?",
    "opcoes": [
      {
        "texto": "Purchase of software with a perpetual license",
        "explicacao": "This is considered CAPEX as it is an investment in an asset"
      },
      {
        "texto": "Monthly subscription to cloud services",
        "explicacao": "This is a typical operational expense (OPEX)"
      },
      {
        "texto": "Acquisition of hardware for servers",
        "explicacao": "This is classified as CAPEX as it involves purchasing physical assets"
      },
      {
        "texto": "One-time payments for consulting services",
        "explicacao": "This payment is also considered CAPEX"
      }
    ],
    "respostaCorreta": "Monthly subscription to cloud services",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following statements about CAPEX is true?",
    "opcoes": [
      {
        "texto": "It is a financial model that typically requires high initial investments",
        "explicacao": "CAPEX involves significant upfront spending to acquire assets"
      },
      {
        "texto": "It allows flexibility in resource allocation",
        "explicacao": "CAPEX is less flexible compared to OPEX"
      },
      {
        "texto": "It consists only of operational expenses",
        "explicacao": "CAPEX refers to capital expenses, not operational expenses"
      },
      {
        "texto": "It is always more advantageous than OPEX",
        "explicacao": "The advantage depends on the context and financial strategy"
      }
    ],
    "respostaCorreta": "It is a financial model that typically requires high initial investments",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When a company considers its cloud strategy, why is it important to distinguish between CAPEX and OPEX?",
    "opcoes": [
      {
        "texto": "To plan cash flow and resource allocation",
        "explicacao": "Understanding these differences helps with effective financial planning"
      },
      {
        "texto": "To avoid buying unnecessary assets",
        "explicacao": "While relevant, the distinction goes beyond asset purchases"
      },
      {
        "texto": "To eliminate all expenses",
        "explicacao": "The distinction doesn't eliminate expenses, it helps with management"
      },
      {
        "texto": "To determine the best security practices",
        "explicacao": "Security is important, but the distinction is more about finance"
      }
    ],
    "respostaCorreta": "To plan cash flow and resource allocation",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a disadvantage of an OPEX model compared to CAPEX?",
    "opcoes": [
      {
        "texto": "Requires a smaller financial commitment",
        "explicacao": "This is an advantage, not a disadvantage"
      },
      {
        "texto": "Can result in higher costs in the long term",
        "explicacao": "In some situations, OPEX can be more expensive compared to CAPEX"
      },
      {
        "texto": "Offers less flexibility to adjust spending",
        "explicacao": "OPEX generally offers more flexibility"
      },
      {
        "texto": "Involves higher initial investment",
        "explicacao": "OPEX usually requires a smaller initial investment than CAPEX"
      }
    ],
    "respostaCorreta": "Can result in higher costs in the long term",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company wants to implement a cloud solution that offers full control over the infrastructure. Which deployment model is most suitable?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are managed by providers and do not offer full control"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds offer full control over the infrastructure, ideal for organizations needing security and control"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds combine public and private clouds but do not offer full control over the infrastructure"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are shared among multiple organizations but do not provide full control for a single company"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following cloud deployment models is most suitable for a startup that wants to minimize costs and is not concerned with full control?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are ideal for startups as they allow access to resources without high upfront investment"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds can be too expensive for a startup"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can be complex and costly to manage"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are shared and are not always the best option for startups"
      }
    ],
    "respostaCorreta": "Public cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company dealing with highly sensitive data decided to use the cloud. Which deployment model is most recommended to ensure security and compliance?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not offer the level of security needed for sensitive data"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are designed for higher security and control over sensitive data"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds offer a combination, but security must be carefully managed"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not provide additional security for sensitive data"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "An organization wants to use both public and private cloud resources to gain flexibility and control. Which deployment model is most suitable?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are less flexible for specific control needs"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds offer control, but not the flexibility of public clouds"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds combine the advantages of both public and private clouds, offering flexibility and control"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are for multiple organizations and do not fit individual control needs"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which deployment model is ideal for organizations that want to share resources with other companies while maintaining some privacy?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are open to any user and do not offer privacy"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are exclusive to one organization and are not shared"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds offer a combination, but they are not specifically for sharing with other companies"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds allow multiple organizations to share resources while maintaining some level of privacy"
      }
    ],
    "respostaCorreta": "Community cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "If a company needs rapid scalability and does not want to invest in hardware, which deployment model should it consider?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds offer scalability on demand without the need for hardware investment"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds require significant hardware investment"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Although scalable, it requires more complex management"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds may be limited in scalability"
      }
    ],
    "respostaCorreta": "Public cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A financial institution is considering the cloud for its IT infrastructure. Which deployment model can offer a balance between security and cost?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not offer the level of security needed for financial institutions"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds offer security, but with higher costs"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can balance security and cost, allowing both types to be used"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not provide adequate security for financial institutions"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following deployment models allows a company to keep its existing data center while expanding to the cloud?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not allow keeping an existing data center"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds require infrastructure to be entirely in the cloud"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds allow the company to integrate its data center with the cloud"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not offer integration with existing data centers"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which deployment model is most suitable for companies that need a specific solution for their regulatory requirements?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not meet specific regulatory requirements"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are designed to meet strict regulatory requirements"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can meet some requirements but do not guarantee full compliance"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds may meet some regulatory needs but are not customizable for specific requirements"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "If an organization wants flexibility in its infrastructure, using both public and private clouds, which deployment model should it choose?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds alone do not offer the desired flexibility"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds limit the use of public cloud"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds are designed to provide flexibility between public and private clouds"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not provide individual flexibility for organizations"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company is seeking maximum control over its infrastructure, in addition to meeting strict security and compliance requirements. Which deployment model would be most appropriate?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not offer full control over infrastructure"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are designed to provide full control and security for sensitive data"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds combine public and private clouds but may not offer full control"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are shared among multiple organizations, without full control for a single company"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A startup wants to quickly access computing resources without high initial costs. Which deployment model is best suited for this situation?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds offer on-demand access to resources, allowing startups to save on initial costs"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds generally require significant investment in hardware"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can be more complex and costly for a startup"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are not ideal for startups due to the lack of flexibility"
      }
    ],
    "respostaCorreta": "Public cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "An organization wants to have a cloud environment that combines its on-premises infrastructure with public cloud resources. Which deployment model should it choose?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not support integration with on-premises infrastructure"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds do not allow use of public resources"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds allow for the integration of on-premises and public resources, providing flexibility"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds are shared among organizations, without integration with on-premises infrastructure"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A financial institution is considering cloud adoption but has concerns about security and regulatory compliance. Which deployment model is most suitable?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not provide the level of security required for financial institutions"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are ideal for meeting security and regulatory compliance requirements"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can be configured to meet requirements, but security must be carefully managed"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not guarantee the necessary security for financial institutions"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company that provides services to different clients in various sectors wants to share computing resources with other organizations. Which deployment model is most appropriate?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are open to everyone and do not provide control over resources"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are exclusive to a single organization and are not shared"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds are not specifically for sharing, but can integrate multiple environments"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds allow multiple organizations to share resources while maintaining privacy"
      }
    ],
    "respostaCorreta": "Community cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which deployment model is most suitable for a company that wants to minimize infrastructure costs and maximize scalability?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds are ideal for minimizing costs and offer on-demand scalability"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds generally involve higher costs due to investment in hardware"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can be complex and more expensive to maintain"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds may not offer the desired scalability"
      }
    ],
    "respostaCorreta": "Public cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "An organization that works with sensitive data wants to strictly control who can access its infrastructure. Which deployment model would be most appropriate?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not provide sufficient control for sensitive data"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds offer full control over access and security"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds can be configured, but security needs to be carefully managed"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not guarantee full control over access"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company wants to adopt the cloud but wants to keep a significant part of its infrastructure on-premises. Which deployment model should it consider?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not allow for on-premises infrastructure to be maintained"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds do not allow for on-premises infrastructure to be maintained"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds allow part of the infrastructure to remain on-premises while using the cloud"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds do not support maintaining on-premises infrastructure"
      }
    ],
    "respostaCorreta": "Hybrid cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which deployment model is ideal for organizations that require a customized solution to meet specific regulatory requirements?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not offer customization to meet regulatory requirements"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds are designed to meet strict and customized regulatory requirements"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds may meet some requirements but do not guarantee full customization"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds may not meet the specific regulatory requirements of each organization"
      }
    ],
    "respostaCorreta": "Private cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company wants to share IT resources with other organizations but without compromising control and security. Which deployment model should it consider?",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "Public clouds do not offer control over shared resources"
      },
      {
        "texto": "Private cloud",
        "explicacao": "Private clouds do not allow sharing with other organizations"
      },
      {
        "texto": "Hybrid cloud",
        "explicacao": "Hybrid clouds may not guarantee the level of control and security desired"
      },
      {
        "texto": "Community cloud",
        "explicacao": "Community clouds allow sharing resources while maintaining control and security"
      }
    ],
    "respostaCorreta": "Community cloud",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company is planning to use AWS to host an application. Which of the following activities is strictly prohibited by AWS's Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Store customer data securely",
        "explicacao": "Storing customer data securely is allowed"
      },
      {
        "texto": "Engage in illegal or unauthorized activities",
        "explicacao": "Engaging in illegal or unauthorized activities is strictly prohibited by the policy"
      },
      {
        "texto": "Use services efficiently",
        "explicacao": "Using services efficiently is encouraged"
      },
      {
        "texto": "Back up data regularly",
        "explicacao": "Backing up data regularly is a recommended practice"
      }
    ],
    "respostaCorreta": "Engage in illegal or unauthorized activities",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following practices complies with AWS's Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Distribute malware or viruses",
        "explicacao": "Distributing malware or viruses is prohibited"
      },
      {
        "texto": "Conduct penetration testing on your own systems with authorization",
        "explicacao": "Conducting authorized penetration testing on your systems is allowed"
      },
      {
        "texto": "Identity theft",
        "explicacao": "Identity theft is strictly prohibited"
      },
      {
        "texto": "Access resources without authorization",
        "explicacao": "Accessing resources without authorization is a violation of the policy"
      }
    ],
    "respostaCorreta": "Conduct penetration testing on your own systems with authorization",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "AWS's Acceptable Use Policy prohibits the use of its services for which type of content?",
    "opcoes": [
      {
        "texto": "Educational content",
        "explicacao": "Educational content is allowed"
      },
      {
        "texto": "Content that promotes hate or violence",
        "explicacao": "Content that promotes hate or violence is prohibited"
      },
      {
        "texto": "Health-related content",
        "explicacao": "Health-related content is allowed as long as it complies with laws and regulations"
      },
      {
        "texto": "Entertainment content",
        "explicacao": "Entertainment content is allowed"
      }
    ],
    "respostaCorreta": "Content that promotes hate or violence",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "According to AWS's Acceptable Use Policy, what should a customer do when detecting a security breach in their services?",
    "opcoes": [
      {
        "texto": "Ignore the breach if it doesn't affect customers",
        "explicacao": "Ignoring a breach is against best practices"
      },
      {
        "texto": "Report it immediately to AWS",
        "explicacao": "Reporting the breach immediately to AWS is the correct action to take"
      },
      {
        "texto": "Share breach details publicly",
        "explicacao": "Sharing breach details publicly is against the policy"
      },
      {
        "texto": "Wait to see if the breach spreads",
        "explicacao": "Waiting is irresponsible and against guidelines"
      }
    ],
    "respostaCorreta": "Report it immediately to AWS",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following actions is not allowed by AWS's Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Use AWS for academic research purposes",
        "explicacao": "Using AWS for academic research is allowed"
      },
      {
        "texto": "Destroy data or systems without authorization",
        "explicacao": "Destroying data or systems without authorization is strictly prohibited"
      },
      {
        "texto": "Create applications for social welfare",
        "explicacao": "Creating applications for social welfare is encouraged"
      },
      {
        "texto": "Access your services securely",
        "explicacao": "Accessing your services securely is allowed"
      }
    ],
    "respostaCorreta": "Destroy data or systems without authorization",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the customer's responsibility according to AWS's Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Protect your access credentials",
        "explicacao": "Customers must protect their access credentials to ensure security"
      },
      {
        "texto": "Allow unauthorized access to your services",
        "explicacao": "Allowing unauthorized access is a violation of the policy"
      },
      {
        "texto": "Share credentials with third parties",
        "explicacao": "Sharing credentials is strictly prohibited"
      },
      {
        "texto": "Neglect data security",
        "explicacao": "Neglecting data security is against best practices"
      }
    ],
    "respostaCorreta": "Protect your access credentials",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "AWS's Acceptable Use Policy applies to which types of customers?",
    "opcoes": [
      {
        "texto": "Only corporate customers",
        "explicacao": "The policy applies to all customers, not just corporate ones"
      },
      {
        "texto": "All AWS customers",
        "explicacao": "All customers, regardless of type, must follow the policy"
      },
      {
        "texto": "Only new customers",
        "explicacao": "The policy applies to all customers, both new and existing"
      },
      {
        "texto": "Only managed services customers",
        "explicacao": "All AWS customers must follow the policy, regardless of the services they use"
      }
    ],
    "respostaCorreta": "All AWS customers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What should be done if an AWS customer violates the Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Receive a warning and be disregarded",
        "explicacao": "Violation may result in corrective actions, not just a warning"
      },
      {
        "texto": "AWS may suspend or terminate the account",
        "explicacao": "Suspending or terminating the account is one of the possible consequences of violating the policy"
      },
      {
        "texto": "Nothing will be done, as the policy is flexible",
        "explicacao": "The policy is strict, and actions can be taken if violated"
      },
      {
        "texto": "Customers may ignore the policy if they wish",
        "explicacao": "Ignoring the policy is not an option; everyone must follow it"
      }
    ],
    "respostaCorreta": "AWS may suspend or terminate the account",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following options is a customer's responsibility in relation to AWS's Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Use AWS for illegal activities",
        "explicacao": "Illegal activities are strictly prohibited by the policy"
      },
      {
        "texto": "Protect hosted data and applications",
        "explicacao": "Protecting hosted data and applications is the customer's responsibility"
      },
      {
        "texto": "Leave data unprotected",
        "explicacao": "Leaving data unprotected is a violation of the policy"
      },
      {
        "texto": "Ignore security alerts",
        "explicacao": "Ignoring security alerts can lead to further issues"
      }
    ],
    "respostaCorreta": "Protect hosted data and applications",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the best practice for optimizing costs when scaling a cloud application?",
    "opcoes": [
      {
        "texto": "Avoid using performance metrics",
        "explicacao": "The use of metrics is crucial for cost optimization"
      },
      {
        "texto": "Focus only on reducing storage costs",
        "explicacao": "Optimization should cover all aspects of costs"
      },
      {
        "texto": "Conduct cost analysis regularly",
        "explicacao": "Regular analysis helps identify cost-saving opportunities"
      },
      {
        "texto": "Scale only during peak hours",
        "explicacao": "Scaling should be continuous, not just during peak hours"
      }
    ],
    "respostaCorreta": "Conduct cost analysis regularly",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company wants to quickly expand its services to customers worldwide. What is one of the main benefits of cloud infrastructure's global reach?",
    "opcoes": [
      {
        "texto": "Deployment speed",
        "explicacao": "Global infrastructure allows rapid deployment in multiple regions"
      },
      {
        "texto": "Higher operational complexity",
        "explicacao": "Global infrastructure tends to reduce complexity, not increase it"
      },
      {
        "texto": "Limitation in geographic reach",
        "explicacao": "Global infrastructure is designed to expand geographic reach"
      },
      {
        "texto": "Dependence on a single data center",
        "explicacao": "Global infrastructure aims to avoid dependence on a single data center"
      }
    ],
    "respostaCorreta": "Deployment speed",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is one of the main benefits of using global cloud infrastructure compared to local data centers?",
    "opcoes": [
      {
        "texto": "Higher latency",
        "explicacao": "Global cloud infrastructure reduces latency by providing services closer to users"
      },
      {
        "texto": "High fixed costs",
        "explicacao": "Cloud infrastructure generally reduces fixed costs"
      },
      {
        "texto": "Increased management complexity",
        "explicacao": "Cloud infrastructure tends to simplify management, not complicate it"
      },
      {
        "texto": "Lower flexibility",
        "explicacao": "Cloud infrastructure offers more flexibility compared to local data centers"
      }
    ],
    "respostaCorreta": "Higher latency",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When considering expanding a service to new markets, what is a key benefit of global cloud infrastructure?",
    "opcoes": [
      {
        "texto": "Ability to quickly reach new customers",
        "explicacao": "Global infrastructure allows rapid deployment in new regions"
      },
      {
        "texto": "Need for more IT staff",
        "explicacao": "Cloud can reduce the need for local staff, not increase it"
      },
      {
        "texto": "Limited scalability",
        "explicacao": "Global infrastructure is designed for scalability"
      },
      {
        "texto": "Reduced availability",
        "explicacao": "Cloud infrastructure increases service availability"
      }
    ],
    "respostaCorreta": "Ability to quickly reach new customers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an advantage of cloud infrastructure regarding time-to-market?",
    "opcoes": [
      {
        "texto": "Increased development time",
        "explicacao": "Cloud generally accelerates development, not delays it"
      },
      {
        "texto": "Fewer available resources",
        "explicacao": "Cloud provides more resources, facilitating a fast launch"
      },
      {
        "texto": "Complex manual processes",
        "explicacao": "Cloud automates many processes, simplifying the launch"
      },
      {
        "texto": "Limited access to technologies",
        "explicacao": "Cloud offers access to a wide range of technologies"
      }
    ],
    "respostaCorreta": "Increased development time",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What cloud benefit allows businesses to offer better-performing services in geographically dispersed locations?",
    "opcoes": [
      {
        "texto": "Data distribution across multiple regions",
        "explicacao": "Cloud allows data to be distributed globally, improving performance"
      },
      {
        "texto": "Centralization of all data",
        "explicacao": "Centralization can increase latency, rather than improve performance"
      },
      {
        "texto": "Reduced network capacity",
        "explicacao": "Cloud typically improves network capacity, not reduces it"
      },
      {
        "texto": "Dependence on a single region",
        "explicacao": "Cloud promotes resilience by avoiding dependence on a single region"
      }
    ],
    "respostaCorreta": "Data distribution across multiple regions",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When discussing deployment speed in the cloud, what is the key factor that enables it?",
    "opcoes": [
      {
        "texto": "Process automation",
        "explicacao": "Automation is key to speeding up service deployment in the cloud"
      },
      {
        "texto": "Need for manual configuration",
        "explicacao": "Manual configuration tends to delay deployment, not accelerate it"
      },
      {
        "texto": "Limitation of computational resources",
        "explicacao": "Cloud offers abundant resources, enabling rapid deployment"
      },
      {
        "texto": "Dependence on physical hardware",
        "explicacao": "Cloud reduces dependence on physical hardware, speeding up deployment"
      }
    ],
    "respostaCorreta": "Process automation",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an economic benefit of global cloud infrastructure compared to having a physical presence in multiple markets?",
    "opcoes": [
      {
        "texto": "Reduction of operational costs",
        "explicacao": "Cloud can significantly reduce operational costs"
      },
      {
        "texto": "Increased management complexity",
        "explicacao": "Cloud tends to simplify management, not complicate it"
      },
      {
        "texto": "High fixed costs",
        "explicacao": "Cloud typically offers variable costs instead of high fixed costs"
      },
      {
        "texto": "Dependence on multiple local suppliers",
        "explicacao": "Cloud allows centralizing services, reducing dependence on local suppliers"
      }
    ],
    "respostaCorreta": "Reduction of operational costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When considering the global reach of the cloud, what is an advantage for businesses operating in multiple regions?",
    "opcoes": [
      {
        "texto": "Consistency in services offered",
        "explicacao": "Cloud enables consistent service offerings across different regions"
      },
      {
        "texto": "Significant differences in performance",
        "explicacao": "Cloud aims to minimize performance differences across regions"
      },
      {
        "texto": "Need for more local equipment",
        "explicacao": "Cloud reduces the need for local equipment"
      },
      {
        "texto": "Limited customization of services",
        "explicacao": "Cloud allows greater customization, not less"
      }
    ],
    "respostaCorreta": "Consistency in services offered",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a cloud benefit that helps businesses respond quickly to market changes?",
    "opcoes": [
      {
        "texto": "Instant scalability",
        "explicacao": "Cloud allows businesses to scale resources quickly based on demand"
      },
      {
        "texto": "Difficulty in adapting infrastructure",
        "explicacao": "Cloud makes it easier to adapt infrastructure to changes"
      },
      {
        "texto": "Increased fixed costs",
        "explicacao": "Cloud tends to reduce fixed costs"
      },
      {
        "texto": "Limitation in accessing new markets",
        "explicacao": "Cloud expands access to new markets"
      }
    ],
    "respostaCorreta": "Instant scalability",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a consequence of violating the AWS Acceptable Use Policy?",
    "opcoes": [
      {
        "texto": "Receiving a discount on services",
        "explicacao": "Receiving discounts is not a consequence of violations"
      },
      {
        "texto": "Account suspension or termination",
        "explicacao": "Account suspension or termination is a possible consequence"
      },
      {
        "texto": "Being promoted to a premium customer",
        "explicacao": "Promotions are not offered as a consequence of violations"
      },
      {
        "texto": "Increase in service capacity",
        "explicacao": "Increasing capacity is not a consequence of violating the policy"
      }
    ],
    "respostaCorreta": "Account suspension or termination",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "A company is evaluating the cost of scaling its cloud infrastructure. Which of the following factors is most important to consider when calculating scaling costs?",
    "opcoes": [
      {
        "texto": "Number of concurrent users",
        "explicacao": "The number of concurrent users can directly impact scaling costs"
      },
      {
        "texto": "Company brand colors",
        "explicacao": "Brand colors have no impact on scaling costs"
      },
      {
        "texto": "Location of physical servers",
        "explicacao": "The location of servers can influence costs, but it is not the most important factor"
      },
      {
        "texto": "Type of programming language used",
        "explicacao": "The programming language used does not directly affect scaling costs"
      }
    ],
    "respostaCorreta": "Number of concurrent users",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When planning the scaling of a cloud application, which cost model can help predict future expenses based on consumption?",
    "opcoes": [
      {
        "texto": "Fixed cost model",
        "explicacao": "A fixed cost model is not ideal for dynamic applications"
      },
      {
        "texto": "Consumption-based cost model",
        "explicacao": "The consumption-based cost model is best suited for predicting cloud expenses"
      },
      {
        "texto": "Volume-based cost model",
        "explicacao": "The volume-based cost model is used, but it is not cloud-specific"
      },
      {
        "texto": "User-based cost model",
        "explicacao": "The user-based cost model does not reflect consumption variations"
      }
    ],
    "respostaCorreta": "Consumption-based cost model",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an economic benefit of cloud auto-scaling?",
    "opcoes": [
      {
        "texto": "Reduction of hardware costs",
        "explicacao": "Auto-scaling eliminates the need for physical hardware"
      },
      {
        "texto": "Increase in fixed costs",
        "explicacao": "Auto-scaling helps avoid high fixed costs"
      },
      {
        "texto": "Lower financial flexibility",
        "explicacao": "Auto-scaling offers greater financial flexibility"
      },
      {
        "texto": "Dependence on a single vendor",
        "explicacao": "Auto-scaling does not necessarily create vendor dependency"
      }
    ],
    "respostaCorreta": "Reduction of hardware costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When calculating the total cost of ownership (TCO) in a cloud environment, which of the following items should be included?",
    "opcoes": [
      {
        "texto": "Only direct computing costs",
        "explicacao": "Direct costs are important, but other factors should also be considered"
      },
      {
        "texto": "Direct and indirect costs",
        "explicacao": "Direct and indirect costs should be included in TCO"
      },
      {
        "texto": "Only technical support costs",
        "explicacao": "Technical support costs are only part of TCO"
      },
      {
        "texto": "Only network costs",
        "explicacao": "Network costs are relevant but insufficient for TCO"
      }
    ],
    "respostaCorreta": "Direct and indirect costs",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How does the pay-as-you-go pricing model impact cloud scaling costs?",
    "opcoes": [
      {
        "texto": "Increases fixed costs",
        "explicacao": "The pay-as-you-go model tends to reduce fixed costs"
      },
      {
        "texto": "Reduces flexibility",
        "explicacao": "The model increases cost flexibility"
      },
      {
        "texto": "Ensures predictable costs",
        "explicacao": "The model does not ensure predictable costs but allows adjustments as needed"
      },
      {
        "texto": "Eliminates the need for financial planning",
        "explicacao": "Financial planning is still necessary, even with pay-as-you-go"
      }
    ],
    "respostaCorreta": "Reduces flexibility",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a critical factor when scaling a cloud application to control costs?",
    "opcoes": [
      {
        "texto": "Choose fixed-price services",
        "explicacao": "Fixed-price services do not allow cost flexibility"
      },
      {
        "texto": "Monitor and optimize resource usage",
        "explicacao": "Monitoring and optimizing resources is essential for controlling costs"
      },
      {
        "texto": "Ignore usage analytics",
        "explicacao": "Ignoring analytics can lead to unnecessary costs"
      },
      {
        "texto": "Implement services only during peak times",
        "explicacao": "Implementing services only during peak times is not an effective strategy"
      }
    ],
    "respostaCorreta": "Monitor and optimize resource usage",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an advantage of vertical scaling compared to horizontal scaling in the cloud?",
    "opcoes": [
      {
        "texto": "Reduces architectural complexity",
        "explicacao": "Vertical scaling tends to be simpler in terms of architecture"
      },
      {
        "texto": "Improves system resilience",
        "explicacao": "Horizontal scaling generally improves resilience"
      },
      {
        "texto": "Increases operational costs",
        "explicacao": "Vertical scaling can increase costs if not well planned"
      },
      {
        "texto": "Facilitates disaster recovery",
        "explicacao": "Vertical scaling does not necessarily facilitate disaster recovery"
      }
    ],
    "respostaCorreta": "Reduces architectural complexity",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "When considering cloud storage costs, which of the following factors can significantly impact the total cost?",
    "opcoes": [
      {
        "texto": "Type of data stored",
        "explicacao": "The type of data stored can affect storage cost"
      },
      {
        "texto": "Number of users accessing the data",
        "explicacao": "The number of users does not directly impact storage cost"
      },
      {
        "texto": "Device screen size",
        "explicacao": "Device screen size does not affect storage cost"
      },
      {
        "texto": "Operating system language",
        "explicacao": "Operating system language is unrelated to storage costs"
      }
    ],
    "respostaCorreta": "Type of data stored",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is one of the main economic risks associated with improper cloud resource scaling?",
    "opcoes": [
      {
        "texto": "Excess cost of underutilized resources",
        "explicacao": "Underutilized resources generate unnecessary costs"
      },
      {
        "texto": "Increased customer satisfaction",
        "explicacao": "Improper scaling can reduce customer satisfaction"
      },
      {
        "texto": "Better system performance",
        "explicacao": "Improper performance can result from incorrect scaling"
      },
      {
        "texto": "Low operating cost",
        "explicacao": "Improper scaling tends to increase operating costs"
      }
    ],
    "respostaCorreta": "Excess cost of underutilized resources",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How does the global cloud infrastructure contribute to innovation in companies?",
    "opcoes": [
      {
        "texto": "Access to new technologies",
        "explicacao": "The cloud provides quick access to new technologies and tools"
      },
      {
        "texto": "Dependence on local solutions",
        "explicacao": "The cloud aims to reduce dependence on local solutions"
      },
      {
        "texto": "Increased bureaucracy",
        "explicacao": "The cloud generally aims to reduce bureaucracy"
      },
      {
        "texto": "Limitation in experimentation",
        "explicacao": "The cloud allows for greater freedom for experimentation and innovation"
      }
    ],
    "respostaCorreta": "Access to new technologies",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is one of the main benefits of high availability in the cloud?",
    "opcoes": [
      {
        "texto": "Minimizing downtime",
        "explicacao": "High availability ensures that services remain accessible even during failures"
      },
      {
        "texto": "Increased operational costs",
        "explicacao": "High availability is designed to reduce costs, not increase them"
      },
      {
        "texto": "Reduced recovery capacity",
        "explicacao": "High availability improves the recovery capacity after failures"
      },
      {
        "texto": "Dependence on a single point of failure",
        "explicacao": "High availability aims to eliminate single points of failure"
      }
    ],
    "respostaCorreta": "Minimizing downtime",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How does cloud elasticity help companies handle demand fluctuations?",
    "opcoes": [
      {
        "texto": "Automatic resource adjustment",
        "explicacao": "Elasticity allows resources to be automatically adjusted as demand increases or decreases"
      },
      {
        "texto": "Limitation of available resources",
        "explicacao": "Elasticity is designed to increase resource availability"
      },
      {
        "texto": "Increased provisioning time",
        "explicacao": "Elasticity aims to reduce the provisioning time for resources"
      },
      {
        "texto": "Dependence on physical hardware",
        "explicacao": "Elasticity minimizes the reliance on physical hardware"
      }
    ],
    "respostaCorreta": "Automatic resource adjustment",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is the main characteristic of agility in the cloud?",
    "opcoes": [
      {
        "texto": "Rapid implementation of solutions",
        "explicacao": "Agility allows companies to implement solutions quickly to meet market needs"
      },
      {
        "texto": "Complex configuration",
        "explicacao": "Agility aims to simplify the configuration and implementation of services"
      },
      {
        "texto": "Increased development time",
        "explicacao": "Agility is designed to reduce development time"
      },
      {
        "texto": "Increased fixed costs",
        "explicacao": "Agility generally helps reduce costs, not increase them"
      }
    ],
    "respostaCorreta": "Rapid implementation of solutions",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How does high availability contribute to the user experience in cloud services?",
    "opcoes": [
      {
        "texto": "Services always available",
        "explicacao": "High availability ensures that services are always accessible to users"
      },
      {
        "texto": "Increased latency",
        "explicacao": "High availability generally aims to reduce latency, not increase it"
      },
      {
        "texto": "Fewer service options",
        "explicacao": "High availability provides more service options, not fewer"
      },
      {
        "texto": "Limited access to resources",
        "explicacao": "High availability aims to increase access to resources"
      }
    ],
    "respostaCorreta": "Services always available",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an example of how elasticity can benefit an e-commerce site during a promotion?",
    "opcoes": [
      {
        "texto": "Automatic provisioning of additional servers",
        "explicacao": "Elasticity allows the e-commerce site to automatically add servers to handle increased traffic"
      },
      {
        "texto": "Reduced responsiveness",
        "explicacao": "Elasticity improves responsiveness, not reduces it"
      },
      {
        "texto": "Dependence on a single server",
        "explicacao": "Elasticity aims to avoid dependence on a single server"
      },
      {
        "texto": "Increased downtime",
        "explicacao": "Elasticity helps minimize downtime during traffic spikes"
      }
    ],
    "respostaCorreta": "Automatic provisioning of additional servers",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is an advantage of agility in the cloud for software development?",
    "opcoes": [
      {
        "texto": "Shorter development cycles",
        "explicacao": "Agility allows development teams to reduce development cycles"
      },
      {
        "texto": "Increased bureaucracy in processes",
        "explicacao": "Agility aims to reduce bureaucracy, not increase it"
      },
      {
        "texto": "Increased complexity in project management",
        "explicacao": "Agility generally seeks to simplify project management"
      },
      {
        "texto": "High fixed costs",
        "explicacao": "Agility can help reduce fixed costs by allowing quick adjustments"
      }
    ],
    "respostaCorreta": "Shorter development cycles",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "How does high availability in the cloud impact disaster recovery?",
    "opcoes": [
      {
        "texto": "Reduced recovery time",
        "explicacao": "High availability allows services to be restored quickly after a disaster"
      },
      {
        "texto": "Dependence on a single data center",
        "explicacao": "High availability aims to eliminate dependence on a single data center"
      },
      {
        "texto": "Limited backup options",
        "explicacao": "High availability generally increases backup options"
      },
      {
        "texto": "Increased downtime",
        "explicacao": "High availability aims to minimize downtime"
      }
    ],
    "respostaCorreta": "Reduced recovery time",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a crucial factor that differentiates cloud elasticity from traditional solutions?",
    "opcoes": [
      {
        "texto": "Dynamic resource adjustment",
        "explicacao": "Elasticity allows resources to be dynamically adjusted as needed"
      },
      {
        "texto": "Dependence on fixed hardware",
        "explicacao": "Elasticity minimizes dependence on fixed hardware"
      },
      {
        "texto": "Increased provisioning complexity",
        "explicacao": "Elasticity aims to simplify resource provisioning"
      },
      {
        "texto": "High fixed costs",
        "explicacao": "Elasticity is designed to reduce fixed costs"
      }
    ],
    "respostaCorreta": "Dynamic resource adjustment",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "What is a benefit of agility that enables continuous innovation in companies using the cloud?",
    "opcoes": [
      {
        "texto": "Rapid iteration and testing of new ideas",
        "explicacao": "Agility in the cloud allows companies to quickly test and implement new ideas"
      },
      {
        "texto": "Increased bureaucracy in approval processes",
        "explicacao": "Agility aims to reduce bureaucracy, facilitating approvals"
      },
      {
        "texto": "Increased waiting time for product launches",
        "explicacao": "Agility helps reduce wait time, speeding up product launches"
      },
      {
        "texto": "Increased operational costs",
        "explicacao": "Agility generally aims to reduce operational costs"
      }
    ],
    "respostaCorreta": "Rapid iteration and testing of new ideas",
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "single"
  },
  {
    "pergunta": "Which of the following scenarios is an example of vertical scaling? (Choose two)",
    "opcoes": [
      {
        "texto": "Adding more AWS EC2 instances via auto-scaling",
        "explicacao": "This is an example of horizontal scaling, increasing the number of instances."
      },
      {
        "texto": "Increasing the capacity of an EC2 instance",
        "explicacao": "Increasing the capacity of an existing instance is an example of vertical scaling."
      },
      {
        "texto": "Decreasing the capacity of an EC2 instance",
        "explicacao": "Decreasing the capacity of an existing instance is another example of vertical scaling."
      },
      {
        "texto": "Enabling parallel execution of workloads and distributing them across many different computers",
        "explicacao": "This is an example of horizontal scaling, distributing the workload."
      }
    ],
    "respostaCorreta": [
      "Increasing the capacity of an EC2 instance",
      "Decreasing the capacity of an EC2 instance"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "What are the advantages of cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Stop worrying about security",
        "explicacao": "While the cloud offers security benefits, responsibility for security is shared between the cloud provider and the customer."
      },
      {
        "texto": "Switch from CAPEX to variable expenses",
        "explicacao": "The cloud allows companies to shift from fixed investments (CAPEX) to operational expenses (OPEX), paying only for services used, which facilitates flexibility and scalability."
      },
      {
        "texto": "Compliance with all local regulations",
        "explicacao": "Compliance with local regulations is the customer's responsibility, though AWS provides tools to help with compliance."
      },
      {
        "texto": "Benefit from economies of scale",
        "explicacao": "Cloud computing allows companies to benefit from economies of scale, paying only for what they use and obtaining lower prices due to shared resource usage."
      }
    ],
    "respostaCorreta": [
      "Switch from CAPEX to variable expenses",
      "Benefit from economies of scale"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "Which of the following are included in the AWS Enterprise support plan? (Choose two)",
    "opcoes": [
      {
        "texto": "A designated Technical Account Manager (TAM)",
        "explicacao": "The Enterprise support plan includes a Technical Account Manager (TAM) to help plan, improve, and optimize AWS resources in a personalized way."
      },
      {
        "texto": "Code development",
        "explicacao": "Code development is not part of the AWS Enterprise support plan. The TAM can provide guidance on architecture but does not develop code."
      },
      {
        "texto": "Well-Architected reviews and operational assessments",
        "explicacao": "The Enterprise support plan includes Well-Architected reviews to ensure that architectures follow best practices, as well as operational assessments for continuous improvement and optimization."
      },
      {
        "texto": "Performing system administration tasks",
        "explicacao": "System administration is not part of the Enterprise support plan. Support provides consulting, but administration remains the customer's responsibility."
      }
    ],
    "respostaCorreta": [
      "A designated Technical Account Manager (TAM)",
      "Well-Architected reviews and operational assessments"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple",
    "fonteSimulado": "udemy"
  },
  {
    "pergunta": "What are the benefits of using cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Reduced cost",
        "explicacao": "Cloud computing allows cost reduction in infrastructure, as there is no need to invest in physical servers."
      },
      {
        "texto": "Scalability",
        "explicacao": "Resources can be quickly adjusted as demand increases or decreases, without requiring major infrastructure changes."
      },
      {
        "texto": "Constant hardware maintenance",
        "explicacao": "In cloud computing, hardware maintenance is managed by the service provider, not the user."
      },
      {
        "texto": "Fixed storage capacity",
        "explicacao": "Unlike fixed capacity, the cloud offers flexibility and scalability to increase or decrease storage as needed."
      }
    ],
    "respostaCorreta": [
      "Reduced cost",
      "Scalability"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main characteristics of cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "On-demand self-service",
        "explicacao": "The cloud allows users to provision resources autonomously and automatically."
      },
      {
        "texto": "Pay upfront for use",
        "explicacao": "Cloud computing follows a pay-as-you-go model, where customers pay only for the resources they use."
      },
      {
        "texto": "Limited scalability",
        "explicacao": "On the contrary, the cloud is highly scalable and is not limited to fixed capacity."
      },
      {
        "texto": "Elasticity",
        "explicacao": "The cloud can quickly adjust the amount of allocated resources as demand varies."
      }
    ],
    "respostaCorreta": [
      "On-demand self-service",
      "Elasticity"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which services are commonly offered in cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Infrastructure as a Service (IaaS)",
        "explicacao": "IaaS provides resources such as virtual machines, storage, and networks through the cloud."
      },
      {
        "texto": "Software as a Service (SaaS)",
        "explicacao": "SaaS enables access to applications over the internet without the need for local installation."
      },
      {
        "texto": "Physical Hardware as a Service (HaaS)",
        "explicacao": "HaaS is not a common offering in cloud computing."
      },
      {
        "texto": "Local Software as a Service (SlaS)",
        "explicacao": "Local software is not a common cloud offering, as it relates to physical installations."
      }
    ],
    "respostaCorreta": [
      "Infrastructure as a Service (IaaS)",
      "Software as a Service (SaaS)"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which cloud deployment models are commonly used? (Choose two)",
    "opcoes": [
      {
        "texto": "Public cloud",
        "explicacao": "The public cloud is managed by third-party providers and used by multiple customers."
      },
      {
        "texto": "Private cloud",
        "explicacao": "The private cloud is intended for the exclusive use of a single organization."
      },
      {
        "texto": "Closed cloud",
        "explicacao": "Closed cloud is not a common deployment model."
      },
      {
        "texto": "Internal cloud",
        "explicacao": "Internal cloud is not a recognized deployment model."
      }
    ],
    "respostaCorreta": [
      "Public cloud",
      "Private cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What benefits does the cloud offer to startups? (Choose two)",
    "opcoes": [
      {
        "texto": "Low initial cost",
        "explicacao": "The cloud allows startups to begin operations without significant investments in infrastructure."
      },
      {
        "texto": "Predictable and static performance",
        "explicacao": "Cloud performance is highly dynamic and depends on allocated resources."
      },
      {
        "texto": "Access to cutting-edge technologies",
        "explicacao": "Startups can quickly access and use cutting-edge technologies in the cloud."
      },
      {
        "texto": "Total dependence on physical hardware",
        "explicacao": "In the cloud, physical hardware is managed by the provider, not the company."
      }
    ],
    "respostaCorreta": [
      "Low initial cost",
      "Access to cutting-edge technologies"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are characteristics of cloud scalability? (Choose two)",
    "opcoes": [
      {
        "texto": "Easily add more resources to accommodate higher demand",
        "explicacao": "Scalability allows for additional resources when demand increases."
      },
      {
        "texto": "Ability to achieve results with minimal resources",
        "explicacao": "This does not relate to scalability but rather to efficiency."
      },
      {
        "texto": "Automated scaling according to demand changes",
        "explicacao": "Scalability includes automated processes that adjust resources based on demand."
      },
      {
        "texto": "Static resources",
        "explicacao": "Cloud resources are highly flexible and can be scaled as needed."
      }
    ],
    "respostaCorreta": [
      "Easily add more resources to accommodate higher demand",
      "Automated scaling according to demand changes"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main characteristics of horizontal scaling? (Choose two)",
    "opcoes": [
      {
        "texto": "Add more instances to distribute the workload",
        "explicacao": "Horizontal scaling focuses on adding more instances to manage the workload."
      },
      {
        "texto": "Increase the size of existing instances",
        "explicacao": "This describes vertical scaling, not horizontal scaling."
      },
      {
        "texto": "Distribute the workload across multiple instances",
        "explicacao": "Workload distribution across instances is a key characteristic of horizontal scaling."
      },
      {
        "texto": "Increase instance capacity",
        "explicacao": "Increasing capacity within the same instance is a vertical scaling strategy."
      }
    ],
    "respostaCorreta": [
      "Add more instances to distribute the workload",
      "Distribute the workload across multiple instances"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which security aspects are facilitated by cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Continuous threat monitoring",
        "explicacao": "Cloud providers often offer continuous security monitoring"
      },
      {
        "texto": "Full responsibility for data security",
        "explicacao": "Data security is a shared responsibility between the provider and the customer"
      },
      {
        "texto": "Encryption of data in transit and at rest",
        "explicacao": "Encryption is a common practice in the cloud to protect data"
      },
      {
        "texto": "Unrestricted access to underlying hardware",
        "explicacao": "Users do not have direct access to hardware in the cloud"
      }
    ],
    "respostaCorreta": [
      "Continuous threat monitoring",
      "Encryption of data in transit and at rest"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the scalability advantages offered by cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Automatic scalability",
        "explicacao": "The cloud allows resources to be automatically scaled as needed"
      },
      {
        "texto": "Limited scalability",
        "explicacao": "On the contrary, the cloud offers near-unlimited scalability"
      },
      {
        "texto": "Quick resource adjustment",
        "explicacao": "The cloud enables the rapid allocation of additional resources as needed"
      },
      {
        "texto": "Scalability only on demand",
        "explicacao": "Scalability in the cloud can be automatic or on demand, depending on the setup"
      }
    ],
    "respostaCorreta": [
      "Automatic scalability",
      "Quick resource adjustment"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the benefits of cloud computing for global companies? (Choose two)",
    "opcoes": [
      {
        "texto": "Access to a global network of data centers",
        "explicacao": "The cloud allows companies to access data centers worldwide, offering low latency and redundancy"
      },
      {
        "texto": "Fixed infrastructure costs",
        "explicacao": "Infrastructure costs in the cloud are generally variable and usage-based"
      },
      {
        "texto": "Better disaster resilience",
        "explicacao": "The cloud provides robust solutions for disaster recovery and high availability"
      },
      {
        "texto": "Requires significant investment in hardware",
        "explicacao": "In the cloud, hardware investment is minimal as it is managed by the provider"
      }
    ],
    "respostaCorreta": [
      "Access to a global network of data centers",
      "Better disaster resilience"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which factors may limit a company's adoption of cloud computing? (Choose two)",
    "opcoes": [
      {
        "texto": "Security and compliance concerns",
        "explicacao": "Some companies may hesitate to adopt the cloud due to data security concerns"
      },
      {
        "texto": "Unlimited flexibility",
        "explicacao": "Although the cloud offers flexibility, it is not unlimited and may have technical restrictions"
      },
      {
        "texto": "Integration with legacy systems",
        "explicacao": "Integrating with legacy systems can be challenging when migrating to the cloud"
      },
      {
        "texto": "Low infrastructure cost",
        "explicacao": "The cloud generally has variable costs, but it may not always be the cheapest option depending on a company's needs"
      }
    ],
    "respostaCorreta": [
      "Security and compliance concerns",
      "Integration with legacy systems"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main functions of a hypervisor? (Choose two)",
    "opcoes": [
      {
        "texto": "Manage virtual machines (VMs)",
        "explicacao": "The hypervisor enables the creation, running, and management of virtual machines"
      },
      {
        "texto": "Eliminate the need for physical hardware",
        "explicacao": "The hypervisor does not eliminate physical hardware, but it facilitates virtualization"
      },
      {
        "texto": "Isolate VMs from each other",
        "explicacao": "The hypervisor ensures virtual machines are isolated so they do not interfere with one another"
      },
      {
        "texto": "Replace operating systems",
        "explicacao": "The hypervisor does not replace operating systems but allows multiple OS to run on a single hardware"
      }
    ],
    "respostaCorreta": [
      "Manage virtual machines (VMs)",
      "Isolate VMs from each other"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main types of hypervisors? (Choose two)",
    "opcoes": [
      {
        "texto": "Type 1 hypervisor",
        "explicacao": "The Type 1 hypervisor runs directly on physical hardware and is known as bare-metal"
      },
      {
        "texto": "Type 2 hypervisor",
        "explicacao": "The Type 2 hypervisor runs on top of an existing operating system"
      },
      {
        "texto": "Type 3 hypervisor",
        "explicacao": "There is no Type 3 hypervisor"
      },
      {
        "texto": "Type 4 hypervisor",
        "explicacao": "There is no Type 4 hypervisor"
      }
    ],
    "respostaCorreta": [
      "Type 1 hypervisor",
      "Type 2 hypervisor"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What advantages does a Type 1 hypervisor offer? (Choose two)",
    "opcoes": [
      {
        "texto": "Better performance",
        "explicacao": "Since it runs directly on hardware, the Type 1 hypervisor offers better performance than Type 2"
      },
      {
        "texto": "Lower management complexity",
        "explicacao": "Managing a Type 1 hypervisor is more complex as it requires hardware knowledge"
      },
      {
        "texto": "Less overhead",
        "explicacao": "The Type 1 hypervisor has less overhead because it runs directly on hardware"
      },
      {
        "texto": "Greater software flexibility",
        "explicacao": "The Type 1 hypervisor focuses on performance, while Type 2 may offer more flexibility for end users"
      }
    ],
    "respostaCorreta": [
      "Better performance",
      "Less overhead"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which components does a virtual machine managed by a hypervisor share with other VMs? (Choose two)",
    "opcoes": [
      {
        "texto": "CPU",
        "explicacao": "Multiple VMs share the physical hardware CPU through virtualization"
      },
      {
        "texto": "Operating system",
        "explicacao": "Each VM runs its own operating system, independently of others"
      },
      {
        "texto": "Memory",
        "explicacao": "The physical hardware memory is shared among virtual machines"
      },
      {
        "texto": "Exclusive storage",
        "explicacao": "Each VM may have its own virtualized storage, which is partitioned and not directly shared"
      }
    ],
    "respostaCorreta": [
      "CPU",
      "Memory"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which characteristics are essential for an efficient hypervisor? (Choose two)",
    "opcoes": [
      {
        "texto": "Ability to dynamically allocate resources",
        "explicacao": "The hypervisor should allow dynamic allocation of resources, like CPU and memory, to VMs"
      },
      {
        "texto": "Runs on older hardware",
        "explicacao": "The hypervisor should run on modern hardware for maximum performance and compatibility"
      },
      {
        "texto": "Support for hardware virtualization",
        "explicacao": "An efficient hypervisor should support hardware-assisted virtualization, like Intel VT-x and AMD-V"
      },
      {
        "texto": "Dependence on a single operating system",
        "explicacao": "The hypervisor is not dependent on a single operating system, allowing multiple systems to run concurrently"
      }
    ],
    "respostaCorreta": [
      "Ability to dynamically allocate resources",
      "Support for hardware virtualization"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the benefits of using hypervisors? (Choose two)",
    "opcoes": [
      {
        "texto": "Server consolidation",
        "explicacao": "The hypervisor allows the consolidation of multiple physical servers into fewer hosts through virtual machines"
      },
      {
        "texto": "Reduced hardware costs",
        "explicacao": "With fewer physical servers, there is a reduction in hardware and energy costs"
      },
      {
        "texto": "Running a single operating system",
        "explicacao": "The hypervisor allows running multiple operating systems, not just one"
      },
      {
        "texto": "Increased energy consumption",
        "explicacao": "On the contrary, the use of hypervisors reduces energy consumption by reducing the number of physical servers needed"
      }
    ],
    "respostaCorreta": [
      "Server consolidation",
      "Reduced hardware costs"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What factors should be considered when choosing a hypervisor? (Choose two)",
    "opcoes": [
      {
        "texto": "Hardware compatibility",
        "explicacao": "The hypervisor must be compatible with the hardware where it will be installed to ensure optimal performance"
      },
      {
        "texto": "Ability to run multiple operating systems simultaneously",
        "explicacao": "One of the main benefits of a hypervisor is the ability to run multiple operating systems on the same hardware"
      },
      {
        "texto": "Exclusive use for local environments",
        "explicacao": "Hypervisors can be used in both local and cloud environments, and are not exclusive to either"
      },
      {
        "texto": "Need for dedicated hardware",
        "explicacao": "The hypervisor does not require dedicated hardware but can run on shared servers"
      }
    ],
    "respostaCorreta": [
      "Hardware compatibility",
      "Ability to run multiple operating systems simultaneously"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the risks associated with using hypervisors? (Choose two)",
    "opcoes": [
      {
        "texto": "Increased risk of cyberattacks",
        "explicacao": "Hypervisors can be targets of attacks, so appropriate security measures need to be implemented"
      },
      {
        "texto": "Reduced ability to scale applications",
        "explicacao": "The hypervisor actually facilitates application scalability rather than reducing it"
      },
      {
        "texto": "Greater dependency on a single point of failure",
        "explicacao": "If the hypervisor fails, all dependent VMs on it will be affected"
      },
      {
        "texto": "Need for multiple operating systems",
        "explicacao": "The need for multiple operating systems is not a risk, but a characteristic of virtualization"
      }
    ],
    "respostaCorreta": [
      "Increased risk of cyberattacks",
      "Greater dependency on a single point of failure"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the differences between Type 1 and Type 2 hypervisors? (Choose two)",
    "opcoes": [
      {
        "texto": "Type 1 runs directly on hardware",
        "explicacao": "Type 1 hypervisors are installed directly on physical hardware without an intermediary OS"
      },
      {
        "texto": "Type 2 runs on top of an operating system",
        "explicacao": "Type 2 hypervisors require a host operating system to run"
      },
      {
        "texto": "Type 1 is more flexible",
        "explicacao": "Type 2 is generally more flexible for home use, while Type 1 is more commonly used in data center environments"
      },
      {
        "texto": "Type 2 eliminates the need for physical hardware",
        "explicacao": "No hypervisor eliminates the need for physical hardware"
      }
    ],
    "respostaCorreta": [
      "Type 1 runs directly on hardware",
      "Type 2 runs on top of an operating system"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main benefits of scalability in a cloud environment? (Choose two)",
    "opcoes": [
      {
        "texto": "Allows rapid adjustment of capacity to meet business demands",
        "explicacao": "Scalability allows resources to be increased or decreased as needed"
      },
      {
        "texto": "Reduces the need for security",
        "explicacao": "Scalability is not directly related to security; it focuses on resource capacity"
      },
      {
        "texto": "Improves operational efficiency by handling variable workloads",
        "explicacao": "Scalability is essential to maintain efficiency during peak loads"
      },
      {
        "texto": "Eliminates the need for hardware maintenance",
        "explicacao": "While the cloud reduces physical maintenance, scalability does not eliminate the need to manage resources"
      }
    ],
    "respostaCorreta": [
      "Allows rapid adjustment of capacity to meet business demands",
      "Improves operational efficiency by handling variable workloads"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What practices help ensure high availability in cloud services? (Choose two)",
    "opcoes": [
      {
        "texto": "Implementation of redundant servers in different availability zones",
        "explicacao": "Geographical redundancy is crucial for high availability"
      },
      {
        "texto": "Limiting the number of users to avoid overload",
        "explicacao": "Limiting users does not guarantee high availability; the system should support higher loads"
      },
      {
        "texto": "Setting up an automatic failover system",
        "explicacao": "Automatic failover ensures that services are quickly restored in case of failure"
      },
      {
        "texto": "Performing scheduled maintenance without notifying users",
        "explicacao": "Maintenance should be notified to minimize impacts on availability"
      }
    ],
    "respostaCorreta": [
      "Implementation of redundant servers in different availability zones",
      "Setting up an automatic failover system"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What characteristics define elasticity in a cloud environment? (Choose two)",
    "opcoes": [
      {
        "texto": "Automatic capacity adjustment in response to demand changes",
        "explicacao": "Elasticity allows resources to adjust dynamically based on workload"
      },
      {
        "texto": "Fixed storage capacity throughout the period",
        "explicacao": "Elasticity implies flexibility, not fixed capacity"
      },
      {
        "texto": "Lower operating costs compared to on-premises infrastructure",
        "explicacao": "Elasticity helps reduce costs by adjusting resources only when needed"
      },
      {
        "texto": "Need for strict capacity planning",
        "explicacao": "Elasticity allows less need for detailed capacity planning"
      }
    ],
    "respostaCorreta": [
      "Automatic capacity adjustment in response to demand changes",
      "Lower operating costs compared to on-premises infrastructure"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What approaches can be used to achieve high availability? (Choose two)",
    "opcoes": [
      {
        "texto": "Load distribution across multiple instances",
        "explicacao": "Distributing the load helps ensure there is no single point of failure"
      },
      {
        "texto": "Storage in a single region",
        "explicacao": "Storing in a single region increases failure risk; distribution is safer"
      },
      {
        "texto": "Using load balancers to direct traffic",
        "explicacao": "Load balancers distribute traffic across instances, improving availability"
      },
      {
        "texto": "Using only one availability zone",
        "explicacao": "Relying on a single zone is not a good practice for high availability"
      }
    ],
    "respostaCorreta": [
      "Load distribution across multiple instances",
      "Using load balancers to direct traffic"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What factors are important for planning system scalability? (Choose two)",
    "opcoes": [
      {
        "texto": "Assessing the expected workload over time",
        "explicacao": "Understanding future workloads is essential for scalability planning"
      },
      {
        "texto": "Investing only in local hardware",
        "explicacao": "Focusing only on local hardware limits scalability and flexibility"
      },
      {
        "texto": "Choosing the appropriate system architecture",
        "explicacao": "The architecture should support scalability, whether vertical or horizontal"
      },
      {
        "texto": "Ignoring growth trends",
        "explicacao": "Ignoring trends can lead to capacity problems in the future"
      }
    ],
    "respostaCorreta": [
      "Assessing the expected workload over time",
      "Choosing the appropriate system architecture"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the essential elements for ensuring elasticity in a cloud application? (Choose two)",
    "opcoes": [
      {
        "texto": "Automated resource provisioning",
        "explicacao": "Automating provisioning allows resources to be adjusted quickly"
      },
      {
        "texto": "Setting a fixed limit of users",
        "explicacao": "Limiting users does not contribute to elasticity; elasticity implies adapting to demand"
      },
      {
        "texto": "Continuous monitoring of application performance",
        "explicacao": "Monitoring performance helps identify when to scale resources up or down"
      },
      {
        "texto": "Local data storage",
        "explicacao": "Elasticity is more effective in cloud-based solutions, which are not fixed"
      }
    ],
    "respostaCorreta": [
      "Automated resource provisioning",
      "Continuous monitoring of application performance"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais práticas ajudam a manter a alta disponibilidade em um sistema em nuvem? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Realizar backups regulares e testes de recuperação",
        "explicacao": "Backups e testes garantem que os dados podem ser recuperados rapidamente em caso de falha"
      },
      {
        "texto": "Confiar em uma única fonte de energia",
        "explicacao": "Confiar em uma única fonte aumenta o risco; ter redundâncias é mais seguro"
      },
      {
        "texto": "Implementar monitoramento em tempo real da infraestrutura",
        "explicacao": "Monitoramento em tempo real ajuda a detectar e responder rapidamente a problemas"
      },
      {
        "texto": "Realizar manutenção não programada com frequência",
        "explicacao": "Manutenções não programadas podem causar inatividade e não são recomendadas"
      }
    ],
    "respostaCorreta": [
      "Realizar backups regulares e testes de recuperação",
      "Implementar monitoramento em tempo real da infraestrutura"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais características tornam um sistema escalável? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Capacidade de adicionar recursos sem interrupção de serviço",
        "explicacao": "Adicionar recursos sem interrupção é essencial para a escalabilidade"
      },
      {
        "texto": "Dependência de hardware específico",
        "explicacao": "Dependência de hardware específico limita a escalabilidade; um sistema escalável deve ser flexível"
      },
      {
        "texto": "Flexibilidade para crescer horizontal ou verticalmente",
        "explicacao": "Sistemas escaláveis podem se expandir em ambas as direções conforme a necessidade"
      },
      {
        "texto": "Uso exclusivo de um único servidor",
        "explicacao": "Um único servidor não é escalável; a escalabilidade requer múltiplos recursos"
      }
    ],
    "respostaCorreta": [
      "Capacidade de adicionar recursos sem interrupção de serviço",
      "Flexibilidade para crescer horizontal ou verticalmente"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais estratégias podem ser implementadas para garantir elasticidade em aplicações de nuvem? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Provisionamento sob demanda de recursos com base em métricas de uso",
        "explicacao": "Provisionamento sob demanda permite que os recursos sejam ajustados de acordo com as necessidades reais"
      },
      {
        "texto": "Utilizar apenas recursos fixos",
        "explicacao": "Recursos fixos não permitem a elasticidade, que depende de adaptações à demanda"
      },
      {
        "texto": "Desenvolvimento de uma arquitetura orientada a eventos",
        "explicacao": "Arquiteturas orientadas a eventos podem responder rapidamente a mudanças na carga de trabalho"
      },
      {
        "texto": "Configuração de limites máximos de uso que não podem ser alterados",
        "explicacao": "Limitar o uso impede que a elasticidade se manifeste plenamente"
      }
    ],
    "respostaCorreta": [
      "Provisionamento sob demanda de recursos com base em métricas de uso",
      "Desenvolvimento de uma arquitetura orientada a eventos"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais são as principais características do modelo IaaS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Os usuários têm controle total sobre a infraestrutura",
        "explicacao": "No IaaS, os usuários gerenciam a infraestrutura virtual, incluindo servidores e armazenamento"
      },
      {
        "texto": "É um modelo totalmente gerenciado pelo provedor",
        "explicacao": "IaaS requer que os usuários gerenciem seus próprios sistemas operacionais e aplicativos"
      },
      {
        "texto": "Os usuários pagam apenas pelo que consomem",
        "explicacao": "IaaS permite que os usuários paguem com base no uso real dos recursos"
      },
      {
        "texto": "É adequado para aplicações de baixo desempenho",
        "explicacao": "IaaS é ideal para aplicações que exigem alta performance e escalabilidade"
      }
    ],
    "respostaCorreta": [
      "Os usuários têm controle total sobre a infraestrutura",
      "Os usuários pagam apenas pelo que consomem"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais são as vantagens do modelo SaaS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Acesso fácil a partir de qualquer dispositivo conectado à internet",
        "explicacao": "SaaS é acessível via navegador, permitindo que os usuários acessem aplicações de qualquer lugar"
      },
      {
        "texto": "Requer instalação e manutenção em cada dispositivo",
        "explicacao": "SaaS é baseado na nuvem e não exige instalação local dos softwares"
      },
      {
        "texto": "Custo de propriedade reduzido em comparação com software tradicional",
        "explicacao": "Com SaaS, os usuários pagam uma taxa de assinatura em vez de custos elevados de licença"
      },
      {
        "texto": "Controle total sobre a personalização do software",
        "explicacao": "SaaS geralmente oferece opções limitadas de personalização em comparação com soluções locais"
      }
    ],
    "respostaCorreta": [
      "Acesso fácil a partir de qualquer dispositivo conectado à internet",
      "Custo de propriedade reduzido em comparação com software tradicional"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual é a principal diferença entre IaaS e SaaS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "IaaS oferece recursos de infraestrutura, enquanto SaaS oferece software pronto para uso",
        "explicacao": "IaaS permite aos usuários gerenciar a infraestrutura, enquanto SaaS é software gerenciado pelo provedor"
      },
      {
        "texto": "IaaS é sempre mais caro que SaaS",
        "explicacao": "Os custos variam dependendo do uso e do modelo, e não há regra fixa sobre preços"
      },
      {
        "texto": "SaaS é focado em desenvolvimento de software, enquanto IaaS é focado em hardware",
        "explicacao": "IaaS fornece recursos de hardware, enquanto SaaS é um serviço de software"
      },
      {
        "texto": "Ambos os modelos oferecem escalabilidade",
        "explicacao": "Tanto IaaS quanto SaaS podem ser escaláveis, mas de maneiras diferentes"
      }
    ],
    "respostaCorreta": [
      "IaaS oferece recursos de infraestrutura, enquanto SaaS oferece software pronto para uso",
      "Ambos os modelos oferecem escalabilidade"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Em qual modelo de computação a manutenção é mais reduzida para o usuário? (Escolha dois)",
    "opcoes": [
      {
        "texto": "IaaS",
        "explicacao": "O usuário precisa gerenciar a infraestrutura, então a manutenção não é reduzida"
      },
      {
        "texto": "PaaS",
        "explicacao": "O provedor gerencia a infraestrutura e as plataformas de desenvolvimento"
      },
      {
        "texto": "SaaS",
        "explicacao": "O SaaS é totalmente gerenciado pelo provedor, reduzindo a carga de manutenção do usuário"
      },
      {
        "texto": "Modelo Tradicional",
        "explicacao": "O modelo tradicional exige manutenção constante por parte do usuário"
      }
    ],
    "respostaCorreta": [
      "PaaS",
      "SaaS"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual dos seguintes modelos permite mais controle sobre a personalização? (Escolha dois)",
    "opcoes": [
      {
        "texto": "IaaS",
        "explicacao": "Os usuários têm controle total sobre a infraestrutura e podem personalizá-la conforme necessário"
      },
      {
        "texto": "PaaS",
        "explicacao": "Os desenvolvedores podem personalizar aplicações, mas não têm controle total da infraestrutura"
      },
      {
        "texto": "SaaS",
        "explicacao": "O provedor controla o software e as personalizações são limitadas"
      },
      {
        "texto": "Modelo Tradicional",
        "explicacao": "Os usuários têm controle total sobre o hardware e software, permitindo alta personalização"
      }
    ],
    "respostaCorreta": [
      "IaaS",
      "Modelo Tradicional"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following models allows companies to focus on development and innovation? (Choose two)",
    "opcoes": [
      {
        "texto": "IaaS",
        "explicacao": "While IaaS offers flexibility, users still need to manage infrastructure"
      },
      {
        "texto": "PaaS",
        "explicacao": "PaaS allows developers to focus on coding, leaving the infrastructure to the provider"
      },
      {
        "texto": "SaaS",
        "explicacao": "SaaS is oriented toward end-users, not development"
      },
      {
        "texto": "Traditional Model",
        "explicacao": "The traditional model can limit innovation capacity due to hardware maintenance needs"
      }
    ],
    "respostaCorreta": [
      "PaaS"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main types of cloud deployment models? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud is owned by cloud service providers and accessible to the general public"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud is used exclusively by a single organization, offering greater control and security"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud combines public and private clouds, allowing data and applications to be shared between them"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud is shared between several organizations with common interests"
      }
    ],
    "respostaCorreta": [
      "Public Cloud",
      "Private Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which deployment model offers the highest security for sensitive data? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud may be less secure due to shared access among multiple organizations"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud is generally more secure as it is dedicated to a single organization"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud can offer security by combining the privacy of the private cloud with the flexibility of the public cloud"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud can be secure but depends on the configuration and security controls adopted"
      }
    ],
    "respostaCorreta": [
      "Private Cloud",
      "Hybrid Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the advantages of using a hybrid cloud model? (Choose two)",
    "opcoes": [
      {
        "texto": "Greater control over data security",
        "explicacao": "The hybrid cloud allows organizations to keep sensitive data in a private cloud"
      },
      {
        "texto": "Lower infrastructure cost",
        "explicacao": "The hybrid cloud can be more expensive due to the need to manage two environments"
      },
      {
        "texto": "Flexibility to scale resources as needed",
        "explicacao": "Organizations can use the public cloud for variable workloads"
      },
      {
        "texto": "Reduced management complexity",
        "explicacao": "The hybrid cloud may increase complexity due to the need to manage multiple platforms"
      }
    ],
    "respostaCorreta": [
      "Greater control over data security",
      "Flexibility to scale resources as needed"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which deployment model is best suited for organizations that require regulatory compliance? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud may not meet all compliance requirements"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud is ideal for organizations needing to control their data and comply with regulations"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud allows sensitive data to be kept in a private environment while other data is stored publicly"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud can be useful, but it depends on the specific compliance requirements of the community"
      }
    ],
    "respostaCorreta": [
      "Private Cloud",
      "Hybrid Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following are characteristics of the public cloud? (Choose two)",
    "opcoes": [
      {
        "texto": "Unlimited access for anyone",
        "explicacao": "The public cloud is accessible to the general public"
      },
      {
        "texto": "Greater control over data and security",
        "explicacao": "Organizations have less control over security in the public cloud"
      },
      {
        "texto": "Lower cost due to economies of scale",
        "explicacao": "The public cloud offers reduced cost due to shared resources"
      },
      {
        "texto": "Complete customization of infrastructure",
        "explicacao": "The public cloud offers limited customization options compared to the private cloud"
      }
    ],
    "respostaCorreta": [
      "Unlimited access for anyone",
      "Lower cost due to economies of scale"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "In which deployment model do organizations have the greatest flexibility of resources? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud offers almost unlimited resource scalability"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud can be scalable but depends on internal infrastructure capacity"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud combines the flexibility of the public cloud with the control of the private cloud"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud can offer flexibility but depends on resources shared among organizations"
      }
    ],
    "respostaCorreta": [
      "Public Cloud",
      "Hybrid Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which deployment models are most suitable for startups? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud is often ideal for startups due to reduced costs and scalability"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud can be costly and less accessible for startups"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud can be useful but may be complex to manage in early stages"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud can be a viable option if multiple startups share the same resources"
      }
    ],
    "respostaCorreta": [
      "Public Cloud",
      "Community Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following deployment models is ideal for critical applications? (Choose two)",
    "opcoes": [
      {
        "texto": "Public Cloud",
        "explicacao": "The public cloud may not be the best option for critical applications due to security concerns"
      },
      {
        "texto": "Private Cloud",
        "explicacao": "The private cloud offers control and security, ideal for critical applications"
      },
      {
        "texto": "Hybrid Cloud",
        "explicacao": "The hybrid cloud can offer a balance between security and flexibility"
      },
      {
        "texto": "Community Cloud",
        "explicacao": "The community cloud can be suitable but depends on the security implemented"
      }
    ],
    "respostaCorreta": [
      "Private Cloud",
      "Hybrid Cloud"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the benefits of a community cloud model? (Choose two)",
    "opcoes": [
      {
        "texto": "Shared costs among organizations",
        "explicacao": "The community cloud allows multiple organizations to share costs and resources"
      },
      {
        "texto": "Complete control over infrastructure",
        "explicacao": "Organizations do not have complete control over infrastructure in the community cloud"
      },
      {
        "texto": "Access to resources that may not be individually accessible",
        "explicacao": "Organizations can access advanced resources that would be expensive individually"
      },
      {
        "texto": "Increased security due to complete isolation",
        "explicacao": "While the community cloud is secure, it does not offer the same isolation as the private cloud"
      }
    ],
    "respostaCorreta": [
      "Shared costs among organizations",
      "Access to resources that may not be individually accessible"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following options best describes scalability in cloud environments? (Choose two)",
    "opcoes": [
      {
        "texto": "Ability to increase or decrease resources manually",
        "explicacao": "Scalability allows resources to be adjusted automatically based on demand"
      },
      {
        "texto": "Ability to add more resources to support growing workloads",
        "explicacao": "Scalability involves adding resources to meet increasing demand"
      },
      {
        "texto": "Ability to ensure that services are always available",
        "explicacao": "High availability refers to service continuity, not scalability"
      },
      {
        "texto": "Ability to handle peak loads dynamically",
        "explicacao": "Dynamic scalability allows resources to be adjusted in real-time"
      }
    ],
    "respostaCorreta": [
      "Ability to add more resources to support growing workloads",
      "Ability to handle peak loads dynamically"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What characterizes elasticity in a cloud architecture? (Choose two)",
    "opcoes": [
      {
        "texto": "Automatic adjustment of resources based on demand",
        "explicacao": "Elasticity refers to the automatic adjustment of resources to meet variable demand"
      },
      {
        "texto": "Maintaining a fixed number of servers",
        "explicacao": "Elasticity does not involve maintaining a fixed number of servers"
      },
      {
        "texto": "Ability to handle rapid changes in workload",
        "explicacao": "Elasticity allows quick responses to changes in workload"
      },
      {
        "texto": "Permanent allocation of resources",
        "explicacao": "Elasticity focuses on temporarily allocating resources as needed"
      }
    ],
    "respostaCorreta": [
      "Automatic adjustment of resources based on demand",
      "Ability to handle rapid changes in workload"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following options is a best practice for ensuring high availability? (Choose two)",
    "opcoes": [
      {
        "texto": "Implement redundancy in critical components",
        "explicacao": "Redundancy helps ensure that if one component fails, another can take over"
      },
      {
        "texto": "Relying on only one cloud region",
        "explicacao": "High availability typically involves multiple regions or zones to avoid single points of failure"
      },
      {
        "texto": "Constantly monitor system performance",
        "explicacao": "Monitoring helps identify issues before they impact availability"
      },
      {
        "texto": "Automatically disable backups",
        "explicacao": "Backups should be kept active for recovery in case of failure"
      }
    ],
    "respostaCorreta": [
      "Implement redundancy in critical components",
      "Constantly monitor system performance"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What is the main difference between scalability and elasticity? (Choose two)",
    "opcoes": [
      {
        "texto": "Scalability is a long-term capacity increase, while elasticity is the ability to quickly adjust resources",
        "explicacao": "Scalability focuses on increasing capacity predictably, while elasticity involves quick adjustments"
      },
      {
        "texto": "Elasticity refers to fixed resources, while scalability refers to dynamic resources",
        "explicacao": "Actually, the opposite is true; elasticity is dynamic, and scalability can be fixed or dynamic"
      },
      {
        "texto": "Both concepts refer to the ability to maintain high availability",
        "explicacao": "High availability is a separate, though related, concept"
      },
      {
        "texto": "Scalability involves horizontal and vertical growth, while elasticity is only horizontal",
        "explicacao": "Elasticity can include both horizontal and vertical growth as needed"
      }
    ],
    "respostaCorreta": [
      "Scalability is a long-term capacity increase, while elasticity is the ability to quickly adjust resources",
      "Both concepts refer to the ability to maintain high availability"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What factors can affect the high availability of a cloud application? (Choose two)",
    "opcoes": [
      {
        "texto": "Improper network configuration",
        "explicacao": "An improper network configuration can lead to connectivity issues and impact availability"
      },
      {
        "texto": "Choice of a single availability zone",
        "explicacao": "Relying on a single zone can lead to disruptions if that zone fails"
      },
      {
        "texto": "Implementation of multiple backup instances",
        "explicacao": "Having multiple instances can improve availability and resilience"
      },
      {
        "texto": "Redundancy in application servers",
        "explicacao": "Redundancy is essential to ensure that if one server fails, others can take over"
      }
    ],
    "respostaCorreta": [
      "Improper network configuration",
      "Choice of a single availability zone"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following examples demonstrates cloud elasticity? (Choose two)",
    "opcoes": [
      {
        "texto": "Automatically increasing the number of instances in response to traffic spikes",
        "explicacao": "This is a classic example of elasticity, where resources adjust automatically"
      },
      {
        "texto": "Adding new servers permanently for each new client",
        "explicacao": "This would be scalability, not elasticity, as it is not dynamic"
      },
      {
        "texto": "Reducing resources when demand decreases",
        "explicacao": "Decreasing resources in response to lower demand is a feature of elasticity"
      },
      {
        "texto": "Maintaining a static infrastructure regardless of load",
        "explicacao": "This does not demonstrate elasticity, as there is no dynamic adjustment"
      }
    ],
    "respostaCorreta": [
      "Automatically increasing the number of instances in response to traffic spikes",
      "Reducing resources when demand decreases"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the benefits of having high availability in an application? (Choose two)",
    "opcoes": [
      {
        "texto": "Reduction of downtime",
        "explicacao": "High availability minimizes the time that the service is down"
      },
      {
        "texto": "Increased operational costs",
        "explicacao": "The goal is to reduce costs, not increase them, although there may be initial setup costs"
      },
      {
        "texto": "Better user experience",
        "explicacao": "With high availability, users have a more consistent and reliable experience"
      },
      {
        "texto": "Increased complexity in resource management",
        "explicacao": "High availability may add complexity, but its main benefit is reliability"
      }
    ],
    "respostaCorreta": [
      "Reduction of downtime",
      "Better user experience"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following options are strategies to achieve scalability in an application? (Choose two)",
    "opcoes": [
      {
        "texto": "Use of load balancers",
        "explicacao": "Load balancers distribute traffic, helping to scale the application"
      },
      {
        "texto": "Limiting instance capacity",
        "explicacao": "Limiting capacity does not help scalability; on the contrary"
      },
      {
        "texto": "Cache implementation",
        "explicacao": "Using cache can help improve performance and scalability"
      },
      {
        "texto": "Avoiding process automation",
        "explicacao": "Automation is essential for efficiently scaling resources"
      }
    ],
    "respostaCorreta": [
      "Use of load balancers",
      "Cache implementation"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What is the relationship between scalability and application performance? (Choose two)",
    "opcoes": [
      {
        "texto": "Scalability can improve performance by adding resources",
        "explicacao": "Adding resources allows the application to support more users simultaneously, improving performance"
      },
      {
        "texto": "Scalability has no impact on performance",
        "explicacao": "This is incorrect; scalability is essential for maintaining performance"
      },
      {
        "texto": "Scalability ensures faster code execution",
        "explicacao": "Scalability does not guarantee faster code execution but helps handle more load"
      },
      {
        "texto": "Scalability ensures that an application can handle more users",
        "explicacao": "This is a main goal of scalability: handling more users without sacrificing performance"
      }
    ],
    "respostaCorreta": [
      "Scalability can improve performance by adding resources",
      "Scalability ensures that an application can handle more users"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual das ações a seguir é considerada uma violação da Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Distribuir malware ou vírus através dos serviços da AWS",
        "explicacao": "Distribuir software malicioso é uma violação clara da política"
      },
      {
        "texto": "Usar os serviços da AWS para fins de aprendizagem e desenvolvimento",
        "explicacao": "Isso é permitido e encorajado na política"
      },
      {
        "texto": "Realizar atividades de hacking ético com autorização",
        "explicacao": "Hacking ético é permitido desde que não infrinja a política"
      },
      {
        "texto": "Fazer tentativas de acesso não autorizado a redes ou sistemas",
        "explicacao": "Tentativas de acesso não autorizado são uma violação da política"
      }
    ],
    "respostaCorreta": [
      "Distribuir malware ou vírus através dos serviços da AWS",
      "Fazer tentativas de acesso não autorizado a redes ou sistemas"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual das seguintes práticas é encorajada pela Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Manter a segurança das credenciais de conta",
        "explicacao": "Manter credenciais seguras é essencial para proteger os recursos na AWS"
      },
      {
        "texto": "Compartilhar credenciais de conta com colegas",
        "explicacao": "Compartilhar credenciais é uma violação das diretrizes de segurança"
      },
      {
        "texto": "Monitorar o uso de recursos e atividades na conta",
        "explicacao": "O monitoramento ajuda a garantir conformidade e segurança"
      },
      {
        "texto": "Utilizar os serviços AWS para práticas de phishing",
        "explicacao": "Phishing é uma violação clara da política"
      }
    ],
    "respostaCorreta": [
      "Manter a segurança das credenciais de conta",
      "Monitorar o uso de recursos e atividades na conta"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual dos seguintes comportamentos deve ser evitado para estar em conformidade com a Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Realizar testes de segurança com autorização prévia",
        "explicacao": "Testes autorizados são geralmente permitidos, contanto que não causem interrupção"
      },
      {
        "texto": "Enviar spam ou e-mails não solicitados",
        "explicacao": "Enviar spam é estritamente proibido pela política"
      },
      {
        "texto": "Utilizar a infraestrutura da AWS para realizar pesquisa acadêmica",
        "explicacao": "Isso é permitido, desde que esteja em conformidade com as diretrizes"
      },
      {
        "texto": "Usar a AWS para comprometer a segurança de outros usuários",
        "explicacao": "Comprometer a segurança de outros é uma violação grave da política"
      }
    ],
    "respostaCorreta": [
      "Enviar spam ou e-mails não solicitados",
      "Usar a AWS para comprometer a segurança de outros usuários"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "O que deve ser feito se um usuário suspeitar de uma violação da Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Ignorar a violação, pois não é responsabilidade do usuário",
        "explicacao": "Os usuários devem relatar quaisquer suspeitas de violação"
      },
      {
        "texto": "Reportar a violação ao suporte da AWS",
        "explicacao": "Relatar ao suporte da AWS é uma prática recomendada"
      },
      {
        "texto": "Documentar a violação e tomar medidas para corrigi-la",
        "explicacao": "Documentar e corrigir é fundamental para manter a conformidade"
      },
      {
        "texto": "Publicar a violação em fóruns públicos",
        "explicacao": "Publicar violação em público pode causar mais problemas e não é aconselhável"
      }
    ],
    "respostaCorreta": [
      "Reportar a violação ao suporte da AWS",
      "Documentar a violação e tomar medidas para corrigi-la"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual das seguintes situações pode resultar em uma violação da Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Usar a AWS para armazenar dados pessoais de forma segura",
        "explicacao": "Armazenar dados pessoais é permitido, contanto que sejam seguidas as diretrizes de segurança"
      },
      {
        "texto": "Fazer uso da infraestrutura AWS para realizar ataques DDoS",
        "explicacao": "Realizar ataques DDoS é uma violação da política"
      },
      {
        "texto": "Implementar práticas de segurança em ambientes AWS",
        "explicacao": "Implementar segurança é uma prática recomendada e não uma violação"
      },
      {
        "texto": "Utilizar recursos da AWS para fraudes financeiras",
        "explicacao": "Fraudes financeiras são uma violação clara da política"
      }
    ],
    "respostaCorreta": [
      "Fazer uso da infraestrutura AWS para realizar ataques DDoS",
      "Utilizar recursos da AWS para fraudes financeiras"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais dos seguintes comportamentos são incentivados pela Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Usar recursos de maneira responsável e ética",
        "explicacao": "O uso responsável e ético é encorajado pela política"
      },
      {
        "texto": "Criar contas falsas para testar serviços",
        "explicacao": "Criar contas falsas é uma violação das diretrizes"
      },
      {
        "texto": "Reportar atividades suspeitas ao suporte da AWS",
        "explicacao": "Reportar suspeitas é encorajado para manter a segurança da plataforma"
      },
      {
        "texto": "Manipular os serviços para obter vantagens indevidas",
        "explicacao": "Manipular serviços é uma violação da política e não é aceitável"
      }
    ],
    "respostaCorreta": [
      "Usar recursos de maneira responsável e ética",
      "Reportar atividades suspeitas ao suporte da AWS"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual é uma consequência de violar a Política de Uso Aceitável da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Suspensão ou encerramento da conta",
        "explicacao": "Violação da política pode resultar em ações disciplinares, incluindo encerramento da conta"
      },
      {
        "texto": "Aumento de recursos disponíveis na conta",
        "explicacao": "A violação não resulta em benefícios, ao contrário, pode resultar em penalizações"
      },
      {
        "texto": "Responsabilidade legal por atividades ilegais",
        "explicacao": "Os usuários podem enfrentar consequências legais se violarem a política"
      },
      {
        "texto": "Notificação de novas ofertas de serviços",
        "explicacao": "A violação da política não resulta em notificações de novos serviços"
      }
    ],
    "respostaCorreta": [
      "Suspensão ou encerramento da conta",
      "Responsabilidade legal por atividades ilegais"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual das seguintes opções é um exemplo de uso aceitável dos serviços da AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Desenvolver e testar aplicativos na nuvem",
        "explicacao": "Desenvolver e testar aplicativos é um uso aceitável da infraestrutura da AWS"
      },
      {
        "texto": "Usar serviços para realizar ataques de força bruta",
        "explicacao": "Realizar ataques de força bruta é uma violação da política"
      },
      {
        "texto": "Criar backups de dados essenciais",
        "explicacao": "Fazer backups é uma prática recomendada para proteção de dados"
      },
      {
        "texto": "Executar operações ilegais que envolvem mineração de dados",
        "explicacao": "Operações ilegais são estritamente proibidas pela política"
      }
    ],
    "respostaCorreta": [
      "Desenvolver e testar aplicativos na nuvem",
      "Criar backups de dados essenciais"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quando usar a arquitetura serverless na AWS? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Para aplicações com picos de tráfego imprevisíveis",
        "explicacao": "A arquitetura serverless é ideal para aplicações que têm tráfego variável"
      },
      {
        "texto": "Para aplicações que requerem provisionamento constante de servidores",
        "explicacao": "Isso não é apropriado para serverless, que elimina o gerenciamento de servidores"
      },
      {
        "texto": "Para aplicações que exigem baixa latência",
        "explicacao": "Serverless pode introduzir latência de inicialização, então é necessário avaliar isso"
      },
      {
        "texto": "Para aplicativos de microserviços",
        "explicacao": "Arquitetura serverless se adapta bem a microserviços devido à sua escalabilidade"
      }
    ],
    "respostaCorreta": [
      "Para aplicações com picos de tráfego imprevisíveis",
      "Para aplicativos de microserviços"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais são algumas limitações do uso de AWS Lambda? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Tempo máximo de execução limitado",
        "explicacao": "AWS Lambda tem um limite de 15 minutos para a duração de uma execução"
      },
      {
        "texto": "Não suporta programação em várias linguagens",
        "explicacao": "AWS Lambda suporta várias linguagens, incluindo Node.js, Python e Java"
      },
      {
        "texto": "Limitações de memória configuráveis",
        "explicacao": "Você pode configurar a memória entre 128 MB e 10 GB, mas há limites"
      },
      {
        "texto": "Totalmente isento de custos",
        "explicacao": "Você paga pelo uso, mas não há custo zero associado ao AWS Lambda"
      }
    ],
    "respostaCorreta": [
      "Tempo máximo de execução limitado",
      "Limitações de memória configuráveis"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais dos seguintes padrões de design são recomendados para uma arquitetura serverless? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Implementar funções pequenas e específicas",
        "explicacao": "Funções menores facilitam a manutenção e a escalabilidade"
      },
      {
        "texto": "Utilizar monólitos para maior eficiência",
        "explicacao": "Monólitos não são recomendados; arquitetura modular é preferível"
      },
      {
        "texto": "Integrar com outros serviços da AWS",
        "explicacao": "Integrar com serviços como S3 e DynamoDB é essencial em uma arquitetura serverless"
      },
      {
        "texto": "Evitar monitoramento e logs",
        "explicacao": "Monitoramento e logging são cruciais para entender o desempenho e solucionar problemas"
      }
    ],
    "respostaCorreta": [
      "Implementar funções pequenas e específicas",
      "Integrar com outros serviços da AWS"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual das seguintes afirmações sobre AWS API Gateway é verdadeira? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Facilita a criação e gerenciamento de APIs RESTful",
        "explicacao": "AWS API Gateway é projetado para facilitar a criação de APIs"
      },
      {
        "texto": "É um serviço serverless que requer gerenciamento de servidores",
        "explicacao": "API Gateway é um serviço serverless e não requer gerenciamento de servidores"
      },
      {
        "texto": "Oferece recursos de autenticação e autorização",
        "explicacao": "O API Gateway fornece suporte para autenticação e autorização de APIs"
      },
      {
        "texto": "Limita o número de solicitações que podem ser feitas",
        "explicacao": "API Gateway pode limitar solicitações, mas isso é configurável, não uma limitação fixa"
      }
    ],
    "respostaCorreta": [
      "Facilita a criação e gerenciamento de APIs RESTful",
      "Oferece recursos de autenticação e autorização"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual é um exemplo de caso de uso ideal para AWS Lambda? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Processamento de imagens em tempo real",
        "explicacao": "AWS Lambda é adequado para processamento de imagens à medida que elas são carregadas"
      },
      {
        "texto": "Serviços de armazenamento de dados permanentes",
        "explicacao": "AWS Lambda não é ideal para armazenamento permanente; serviços como S3 são melhores"
      },
      {
        "texto": "Desencadear eventos a partir de alterações em um banco de dados",
        "explicacao": "AWS Lambda pode ser acionado por alterações em bancos de dados como DynamoDB"
      },
      {
        "texto": "Executar aplicativos de longa duração",
        "explicacao": "AWS Lambda não é ideal para aplicativos que exigem longas execuções"
      }
    ],
    "respostaCorreta": [
      "Processamento de imagens em tempo real",
      "Desencadear eventos a partir de alterações em um banco de dados"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "O que é AWS Step Functions? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Um serviço para orquestrar microserviços serverless",
        "explicacao": "AWS Step Functions permite orquestrar serviços e funções AWS em workflows"
      },
      {
        "texto": "Um banco de dados NoSQL da AWS",
        "explicacao": "Step Functions não é um banco de dados; é uma ferramenta de orquestração"
      },
      {
        "texto": "Um serviço que permite criar aplicações de várias etapas",
        "explicacao": "Permite criar aplicações serverless com lógica de controle de fluxo"
      },
      {
        "texto": "Uma função que precisa ser gerenciada manualmente",
        "explicacao": "AWS Step Functions é um serviço gerenciado e não requer gerenciamento manual"
      }
    ],
    "respostaCorreta": [
      "Um serviço para orquestrar microserviços serverless",
      "Um serviço que permite criar aplicações de várias etapas"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Qual dos seguintes serviços é frequentemente usado em conjunto com AWS Lambda para armazenar dados? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Amazon RDS",
        "explicacao": "Amazon RDS é um serviço de banco de dados relacional que pode ser integrado ao Lambda"
      },
      {
        "texto": "Amazon S3",
        "explicacao": "Amazon S3 é frequentemente usado para armazenar arquivos que são processados por funções Lambda"
      },
      {
        "texto": "AWS Glue",
        "explicacao": "AWS Glue é um serviço de ETL que pode ser usado, mas não é o mais comum para armazenamento de dados"
      },
      {
        "texto": "Amazon DynamoDB",
        "explicacao": "Amazon DynamoDB é um banco de dados NoSQL frequentemente usado com AWS Lambda"
      }
    ],
    "respostaCorreta": [
      "Amazon S3",
      "Amazon DynamoDB"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Como a escalabilidade pode impactar os custos em uma arquitetura em nuvem? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Escalabilidade pode reduzir custos ao ajustar recursos conforme a demanda",
        "explicacao": "Com a escalabilidade, você paga apenas pelos recursos que usa quando há aumento ou diminuição da demanda"
      },
      {
        "texto": "Escalabilidade aumenta os custos fixos de infraestrutura",
        "explicacao": "Escalabilidade geralmente reduz custos fixos, já que não é necessário manter recursos ociosos"
      },
      {
        "texto": "A escalabilidade pode evitar o subdimensionamento e aumentar a disponibilidade",
        "explicacao": "Ao escalar adequadamente, você pode evitar falhas e aumentar a disponibilidade dos serviços"
      },
      {
        "texto": "Escalabilidade sempre resulta em custos menores",
        "explicacao": "Embora a escalabilidade possa reduzir custos em algumas situações, o aumento de recursos também pode elevar os gastos"
      }
    ],
    "respostaCorreta": [
      "Escalabilidade pode reduzir custos ao ajustar recursos conforme a demanda",
      "A escalabilidade pode evitar o subdimensionamento e aumentar a disponibilidade"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Como a elasticidade afeta os custos operacionais na nuvem? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Elasticidade permite aumentar ou reduzir recursos conforme a demanda",
        "explicacao": "Isso permite que as empresas controlem melhor os custos, pagando apenas pelo que realmente utilizam"
      },
      {
        "texto": "Elasticidade elimina a necessidade de pagar por capacidade ociosa",
        "explicacao": "Com a elasticidade, os recursos são liberados quando não estão em uso, evitando custos desnecessários"
      },
      {
        "texto": "Elasticidade é incompatível com modelos de negócios que exigem custos fixos",
        "explicacao": "Na verdade, a elasticidade é ideal para modelos que precisam adaptar-se rapidamente às mudanças de demanda"
      },
      {
        "texto": "Elasticidade aumenta os custos de forma fixa",
        "explicacao": "Elasticidade não aumenta os custos de forma fixa; ela os ajusta de acordo com a demanda"
      }
    ],
    "respostaCorreta": [
      "Elasticidade permite aumentar ou reduzir recursos conforme a demanda",
      "Elasticidade elimina a necessidade de pagar por capacidade ociosa"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Quais são os benefícios econômicos de usar instâncias sob demanda em vez de instâncias reservadas? (Escolha dois)",
    "opcoes": [
      {
        "texto": "Permite maior flexibilidade para lidar com variações de tráfego",
        "explicacao": "Instâncias sob demanda permitem ajustar os recursos sem compromissos de longo prazo"
      },
      {
        "texto": "Garante custos previsíveis por um período longo",
        "explicacao": "Isso é um benefício de instâncias reservadas, não de sob demanda"
      },
      {
        "texto": "Não exige pagamento antecipado",
        "explicacao": "Instâncias sob demanda não exigem pagamento antecipado, o que ajuda a controlar custos em curto prazo"
      },
      {
        "texto": "Sempre mais barato que instâncias reservadas",
        "explicacao": "Instâncias sob demanda podem ser mais caras em períodos de uso contínuo"
      }
    ],
    "respostaCorreta": [
      "Permite maior flexibilidade para lidar com variações de tráfego",
      "Não exige pagamento antecipado"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How can the global cloud infrastructure help companies looking to expand their services internationally? (Choose two)",
    "opcoes": [
      {
        "texto": "Facilitates deployment of services in new regions",
        "explicacao": "With global infrastructure, companies can launch services in different regions quickly without the need for a physical presence"
      },
      {
        "texto": "Increases the complexity of service integration",
        "explicacao": "Global infrastructure typically simplifies rather than complicates the integration of services across regions"
      },
      {
        "texto": "Reduces the need for maintenance in local data centers",
        "explicacao": "With global infrastructure, companies can focus more on service operation and less on physical data center maintenance"
      },
      {
        "texto": "Ensures lower fixed operational costs",
        "explicacao": "While it may optimize costs, global infrastructure does not automatically guarantee lower fixed costs"
      }
    ],
    "respostaCorreta": [
      "Facilitates deployment of services in new regions",
      "Reduces the need for maintenance in local data centers"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the advantages of replicating data across multiple regions in global cloud infrastructure? (Choose two)",
    "opcoes": [
      {
        "texto": "Improves disaster recovery",
        "explicacao": "Replicating data across multiple regions ensures that data remains available even if a disaster occurs in a specific region"
      },
      {
        "texto": "Increases storage costs",
        "explicacao": "While multi-region replication can increase storage costs, it is offset by benefits such as disaster recovery"
      },
      {
        "texto": "Reduces latency for global users",
        "explicacao": "Replicating data across multiple regions allows data to be accessed more quickly by users in different parts of the world"
      },
      {
        "texto": "Eliminates the need for regular backups",
        "explicacao": "Data replication complements but does not replace the need for regular backups"
      }
    ],
    "respostaCorreta": [
      "Improves disaster recovery",
      "Reduces latency for global users"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does the global cloud infrastructure ensure high availability? (Choose two)",
    "opcoes": [
      {
        "texto": "By providing services across multiple geographic regions",
        "explicacao": "Distributing services across regions helps maintain availability even in cases of localized failures"
      },
      {
        "texto": "By using local servers in each data center",
        "explicacao": "Global infrastructure generally reduces reliance on local servers, preferring replication across multiple regions"
      },
      {
        "texto": "Allows automatic failover between regions",
        "explicacao": "Global infrastructure offers automatic failover, ensuring services continue operating in the event of regional failures"
      },
      {
        "texto": "Reducing the need for redundancy",
        "explicacao": "Global cloud infrastructure encourages redundancy rather than eliminating it"
      }
    ],
    "respostaCorreta": [
      "By providing services across multiple geographic regions",
      "Allows automatic failover between regions"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What factors should be considered when using global infrastructure to improve application performance? (Choose two)",
    "opcoes": [
      {
        "texto": "Latency between data center regions",
        "explicacao": "Latency between regions can impact application performance, especially for distant users"
      },
      {
        "texto": "Data replication cost between regions",
        "explicacao": "Replicating data between regions can improve performance for global users, but may increase operational costs"
      },
      {
        "texto": "Increase in local servers",
        "explicacao": "Global infrastructure generally reduces the need for local servers"
      },
      {
        "texto": "Integration capability with legacy systems",
        "explicacao": "Application performance may also depend on the ability to integrate with legacy systems in different regions"
      }
    ],
    "respostaCorreta": [
      "Latency between data center regions",
      "Data replication cost between regions"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does global infrastructure help with compliance with local data regulations? (Choose two)",
    "opcoes": [
      {
        "texto": "Allows data to be stored in specific regions",
        "explicacao": "Global infrastructure allows data to be stored in locations that meet compliance requirements for specific countries"
      },
      {
        "texto": "Reduces the need for data encryption",
        "explicacao": "While global infrastructure helps with compliance, it does not replace security practices like data encryption"
      },
      {
        "texto": "Facilitates control of data flow between regions",
        "explicacao": "Global infrastructure facilitates data flow management between regions, helping to meet local regulations"
      },
      {
        "texto": "Eliminates the need for compliance audits",
        "explicacao": "Compliance audits are still necessary even with global infrastructure"
      }
    ],
    "respostaCorreta": [
      "Allows data to be stored in specific regions",
      "Facilitates control of data flow between regions"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does global cloud infrastructure impact data security? (Choose two)",
    "opcoes": [
      {
        "texto": "Offers encryption options for data in transit and at rest",
        "explicacao": "Global infrastructure enables encryption to protect data both in transit and at rest"
      },
      {
        "texto": "Increases latency due to the need for encryption",
        "explicacao": "Encryption may impact latency, but global infrastructure options help mitigate this effect"
      },
      {
        "texto": "Facilitates compliance with international security standards",
        "explicacao": "Global infrastructure helps companies meet security requirements in various regions, such as GDPR or ISO"
      },
      {
        "texto": "Eliminates the need for backups",
        "explicacao": "Global infrastructure improves security but does not eliminate the need for backups"
      }
    ],
    "respostaCorreta": [
      "Offers encryption options for data in transit and at rest",
      "Facilitates compliance with international security standards"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the benefits of using availability zones in global cloud infrastructure? (Choose two)",
    "opcoes": [
      {
        "texto": "Increases resilience to data center failures",
        "explicacao": "Availability zones are designed to provide resilience, protecting against localized failures"
      },
      {
        "texto": "Reduces the need for data backups",
        "explicacao": "Availability zones increase resilience but do not replace the need for data backups"
      },
      {
        "texto": "Facilitates automatic failover",
        "explicacao": "With availability zones, automatic failover can be set up in case of regional failures"
      },
      {
        "texto": "Eliminates the need for load balancing",
        "explicacao": "Load balancing is still a recommended practice, even with the use of availability zones"
      }
    ],
    "respostaCorreta": [
      "Increases resilience to data center failures",
      "Facilitates automatic failover"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the key benefits of high availability in cloud-based systems? (Choose two)",
    "opcoes": [
      {
        "texto": "Continuity of services during failures",
        "explicacao": "High availability ensures services continue to operate even when some components fail"
      },
      {
        "texto": "Reduction in infrastructure costs",
        "explicacao": "While high availability improves continuity, it does not necessarily reduce infrastructure costs"
      },
      {
        "texto": "Increased resilience to failures",
        "explicacao": "High availability systems are designed to withstand failures and continue operating without interruption"
      },
      {
        "texto": "Elimination of the need for backups",
        "explicacao": "High availability does not eliminate the need for regular backups"
      }
    ],
    "respostaCorreta": [
      "Continuity of services during failures",
      "Increased resilience to failures"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does elasticity in a cloud environment help optimize resources? (Choose two)",
    "opcoes": [
      {
        "texto": "Adjusts resources based on demand",
        "explicacao": "Elasticity allows for automatic adjustments of resources, increasing or decreasing based on demand"
      },
      {
        "texto": "Eliminates the need for resource monitoring",
        "explicacao": "Resource monitoring remains essential to ensure elasticity is aligned with operational requirements"
      },
      {
        "texto": "Reduces over-provisioning costs",
        "explicacao": "By scaling resources up or down as needed, elasticity helps to avoid over-provisioning and reduces associated costs"
      },
      {
        "texto": "Eliminates redundancy",
        "explicacao": "Elasticity does not eliminate redundancy; rather, it optimizes resource use dynamically"
      }
    ],
    "respostaCorreta": [
      "Adjusts resources based on demand",
      "Reduces over-provisioning costs"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What is the economic impact of good capacity planning in the cloud? (Choose two)",
    "opcoes": [
      {
        "texto": "Reduces the risk of paying for idle resources",
        "explicacao": "Capacity planning allows for more efficient resource allocation, reducing waste"
      },
      {
        "texto": "Increases the total cost of ownership (TCO)",
        "explicacao": "In fact, good capacity planning helps reduce TCO by avoiding unnecessary expenses"
      },
      {
        "texto": "Improves operational efficiency",
        "explicacao": "With correctly sized capacity, the company can operate more efficiently"
      },
      {
        "texto": "Increases initial investment costs",
        "explicacao": "Capacity planning does not necessarily increase initial costs but optimizes resources over time"
      }
    ],
    "respostaCorreta": [
      "Reduces the risk of paying for idle resources",
      "Improves operational efficiency"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How do on-demand payment models impact a company's economy? (Choose two)",
    "opcoes": [
      {
        "texto": "Allows companies to pay only for actual resource usage",
        "explicacao": "With the on-demand model, companies avoid high fixed costs and only pay for resources used"
      },
      {
        "texto": "Reduces fixed costs by eliminating the need to buy own hardware",
        "explicacao": "The on-demand model eliminates the need for large upfront investments in infrastructure"
      },
      {
        "texto": "Increases fixed operational costs",
        "explicacao": "The on-demand model reduces fixed operational costs as the company only pays for what it uses"
      },
      {
        "texto": "Prevents companies from optimizing costs over time",
        "explicacao": "On the contrary, the on-demand model helps companies adjust costs as usage fluctuates"
      }
    ],
    "respostaCorreta": [
      "Allows companies to pay only for actual resource usage",
      "Reduces fixed costs by eliminating the need to buy own hardware"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "Which of the following approaches can help reduce costs in a cloud architecture? (Choose two)",
    "opcoes": [
      {
        "texto": "Use reserved instances for predictable workloads",
        "explicacao": "Reserved instances guarantee lower prices for long-term, predictable workloads"
      },
      {
        "texto": "Increase idle resources to ensure performance",
        "explicacao": "Having too many idle resources can increase costs without direct benefits"
      },
      {
        "texto": "Use auto-scaling to adjust capacity",
        "explicacao": "Auto-scaling adjusts resources according to demand, avoiding unnecessary costs"
      },
      {
        "texto": "Maintain maximum capacity at all times",
        "explicacao": "This would increase costs unnecessarily; capacity should be adjusted based on demand"
      }
    ],
    "respostaCorreta": [
      "Use reserved instances for predictable workloads",
      "Use auto-scaling to adjust capacity"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What factors influence the total cost of ownership (TCO) when using the cloud? (Choose two)",
    "opcoes": [
      {
        "texto": "Costs of hardware management and maintenance",
        "explicacao": "In the cloud, these costs are reduced as the service provider manages the infrastructure"
      },
      {
        "texto": "Ability to adjust resources based on demand",
        "explicacao": "The flexibility to adjust resources in the cloud helps optimize TCO"
      },
      {
        "texto": "Initial investment in physical servers",
        "explicacao": "The cloud reduces the need for large upfront investments in physical infrastructure"
      },
      {
        "texto": "Fixed licensing costs",
        "explicacao": "In the cloud, many licensing costs can be reduced or eliminated depending on the service used"
      }
    ],
    "respostaCorreta": [
      "Costs of hardware management and maintenance",
      "Ability to adjust resources based on demand"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the economic challenges when scaling applications in a cloud environment? (Choose two)",
    "opcoes": [
      {
        "texto": "Variable costs can be difficult to predict",
        "explicacao": "With scalability, costs can fluctuate as demand increases or decreases, making prediction difficult"
      },
      {
        "texto": "Scalability always reduces operational costs",
        "explicacao": "Scalability does not always reduce costs, especially when demand increases"
      },
      {
        "texto": "Maintaining idle resources can increase expenses",
        "explicacao": "Idle resources can incur costs without providing direct benefits if not properly managed"
      },
      {
        "texto": "Vertical scaling is always more economical than horizontal scaling",
        "explicacao": "This statement depends on the application and required resources; vertical scaling is not always the more economical option"
      }
    ],
    "respostaCorreta": [
      "Variable costs can be difficult to predict",
      "Maintaining idle resources can increase expenses"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does high availability impact cloud costs? (Choose two)",
    "opcoes": [
      {
        "texto": "Increases costs due to the need for redundancy",
        "explicacao": "To ensure high availability, redundancy is necessary, which can increase costs"
      },
      {
        "texto": "Reduces costs by minimizing downtime",
        "explicacao": "Less downtime means less loss of revenue and productivity, reducing overall costs"
      },
      {
        "texto": "Eliminates the need for disaster recovery",
        "explicacao": "High availability and disaster recovery are complementary, not substitutes"
      },
      {
        "texto": "Reduces costs by avoiding the need for data backup",
        "explicacao": "High availability does not eliminate the need for backups, as they are essential for data recovery"
      }
    ],
    "respostaCorreta": [
      "Increases costs due to the need for redundancy",
      "Reduces costs by minimizing downtime"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What strategies can be used to control costs when scaling in the cloud? (Choose two)",
    "opcoes": [
      {
        "texto": "Use auto-scaling to increase or decrease resources as needed",
        "explicacao": "Auto-scaling adjusts resources as demand changes, avoiding overloads and waste"
      },
      {
        "texto": "Keep instances running full-time",
        "explicacao": "Keeping instances running at all times can increase costs, especially when demand is low"
      },
      {
        "texto": "Scale horizontally to distribute the load",
        "explicacao": "Horizontal scaling can be more cost-effective as it distributes the load among multiple smaller instances"
      },
      {
        "texto": "Increase storage capacity permanently",
        "explicacao": "Permanently increasing storage can incur unnecessary costs"
      }
    ],
    "respostaCorreta": [
      "Use auto-scaling to increase or decrease resources as needed",
      "Scale horizontally to distribute the load"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the main benefits of a global cloud infrastructure? (Choose two)",
    "opcoes": [
      {
        "texto": "Improved deployment speed",
        "explicacao": "Global infrastructure allows for quick deployment of resources and services across multiple regions"
      },
      {
        "texto": "Reduction of fixed operational costs",
        "explicacao": "While global infrastructure can help optimize costs, it does not completely eliminate fixed costs"
      },
      {
        "texto": "Global reach",
        "explicacao": "Global infrastructure provides availability in multiple regions, facilitating service delivery anywhere in the world"
      },
      {
        "texto": "Elimination of server failures",
        "explicacao": "Global infrastructure improves resilience, but cannot completely eliminate the risk of server failures"
      }
    ],
    "respostaCorreta": [
      "Improved deployment speed",
      "Global reach"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "How does global cloud infrastructure improve the end-user experience? (Choose two)",
    "opcoes": [
      {
        "texto": "Reduces latency",
        "explicacao": "With data centers closer to users, global infrastructure helps reduce latency and improve response times"
      },
      {
        "texto": "Eliminates regional network failures",
        "explicacao": "Global infrastructure improves resilience but does not eliminate regional network issues"
      },
      {
        "texto": "Improves availability",
        "explicacao": "Global infrastructure ensures greater availability and redundancy, improving uptime"
      },
      {
        "texto": "Reduces hardware maintenance costs",
        "explicacao": "Although it reduces the need for hardware maintenance, this benefit does not directly affect the end-user experience"
      }
    ],
    "respostaCorreta": [
      "Reduces latency",
      "Improves availability"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  },
  {
    "pergunta": "What are the key security benefits of a global cloud infrastructure? (Choose two)",
    "opcoes": [
      {
        "texto": "Reduces risk of data loss through redundancy",
        "explicacao": "Redundancy in a global infrastructure protects against data loss in case of failure"
      },
      {
        "texto": "Eliminates the need for security updates",
        "explicacao": "Security updates remain essential even in a global infrastructure"
      },
      {
        "texto": "Enables data isolation",
        "explicacao": "Global infrastructure allows for data segregation, improving security and compliance"
      },
      {
        "texto": "Automatically prevents all cyber-attacks",
        "explicacao": "No infrastructure is immune to all cyber threats; additional protection measures are required"
      }
    ],
    "respostaCorreta": [
      "Reduces risk of data loss through redundancy",
      "Enables data isolation"
    ],
    "dominio": "Conceitos da nuvem",
    "dominioKey": "cloud_concepts",
    "tipo": "multiple"
  }
]
